{"disease": {"idxs": ["155", "263", "250", "272", "401", "293", "571", "070", "996", "997", "486", "584", "276"], "name": ["Malignant neoplasm of liver and intrahepatic bile ducts", "Other and unspecified protein-calorie malnutrition", "Diabetes mellitus", "Disorders of lipoid metabolism", "Essential hypertension", "Transient organic psychotic conditions", "Chronic liver disease and cirrhosis", "Viral hepatitis", "Complications peculiar to certain specified procedures", "Complications affecting specified body system not elsewhere classified", "Pneumonia, organism unspecified", "Acute renal failure", "Disorders of fluid, electrolyte, and acid-base balance"], "def": ["Malignant neoplasm of liver and intrahepatic bile ducts, also known as bile duct neoplasms, includes liver cancer, bile duct cancer, and liver adenoma, with hepatocellular carcinoma invasion of the bile duct being rare and having a poor prognosis.", "Other and unspecified protein-calorie malnutrition is a condition characterized by insufficient energy or protein intake, leading to various complications such as anemia, heart problems, bone loss, muscle loss, gastrointestinal issues, electrolyte abnormalities, and kidney problems.", "Diabetes mellitus is a group of metabolic disorders characterized by high blood sugar levels, insulin deficiency or unresponsiveness, and various complications such as cardiovascular disease, kidney disease, and infections.", "Disorders of lipoid metabolism involve abnormal anabolism or catabolism of lipids in the body, including fatty acid oxidation disorders and X linked adrenoleukodystrophy, which is characterized by the accumulation of very long chain fatty acids and affects cholesterol metabolism.", "Essential hypertension, also known as primary hypertension, is the most common type of high blood pressure that develops gradually over time without a known cause, affecting 85% of those with high blood pressure, and is associated with increased risk of cardiovascular disease.", "Transient organic psychotic conditions are psychotic organic mental disorders caused by the toxic effect of drugs and chemicals, and they differ from persistent delusional disorders and acute and transient psychotic disorders in terms of various factors such as demographics, symptomatic outcome, and social consequences.", "Chronic liver disease and cirrhosis is a progressive liver condition characterized by fibrosis and scarring, often caused by underlying liver diseases, and can lead to acute liver failure and an increased risk of hepatocellular carcinoma.", "Viral hepatitis is a liver inflammation caused by various viruses, including hepatitis A, B, C, D, and E, as well as other viruses such as cytomegalovirus, Epstein-Barr virus, and herpes simplex virus, and it can present as acute or chronic infection with potential complications such as liver failure, hepatocellular carcinoma, and vertical transmission during pregnancy.", "Complications peculiar to certain specified procedures, such as postoperative complications, can vary depending on the surgical procedure and may require special attention, and the Clavien Dindo classification is a validated tool for assessing surgical complications.", "Complications affecting specified body systems not elsewhere classified can arise from various diseases, including diabetes mellitus, surgical procedures, and diseases of the digestive system, leading to pathological processes in multiple organs and tissues such as the eye, kidney, blood vessels, and nerve tissue.", "Pneumonia, organism unspecified, is a respiratory infection that can be caused by various organisms, including Chlamydophila pneumoniae, and can occur in both healthcare settings and the community, leading to inflammation and consolidation of the lung parenchyma.", "Acute renal failure, also known as acute kidney injury, is a sudden decrease in kidney function that can be caused by various factors such as decreased blood flow, direct kidney damage, or blockage of urine flow, and it is characterized by symptoms like decreased urinary output, fluid retention, nausea, fatigue, and shortness of breath.", "Patients with disorders of fluid, electrolyte, and acid-base balance may experience disturbances in acid-base equilibrium, electrolyte imbalances, dehydration, and impaired kidney function, which can lead to fluid shifts and metabolic alkalosis."]}, "prescription": {"idxs": ["94", "4", "27", "16", "180", "11", "9", "24", "836", "69", "51", "5", "237", "238", "22", "15", "340", "82", "8", "90", "358", "3", "77", "26", "66", "287", "145", "74", "75", "390", "341", "305", "72", "68", "1187", "36", "28", "127", "19", "20", "38", "85", "466", "58", "55", "71", "88", "7", "86", "93", "30", "377", "479", "116", "40", "17", "67", "441", "300", "44", "70", "402", "157", "117", "132", "315", "246", "250", "65", "39", "2", "119", "360", "0", "92", "118", "168", "556", "23", "498", "21"], "name": ["Ipratropium Bromide Neb", "Furosemide", "SW", "Potassium Chloride", "Dextrose 50%", "Zolpidem Tartrate", "Insulin", "Morphine Sulfate", "CycloSPORINE Modified (Neoral)", "Diphenhydramine HCl", "Prednisone", "Mycophenolate Mofetil", "Multivitamin IV", "Amino Acids 4.25% W/ Dextrose 5%", "Oxycodone-Acetaminophen", "Magnesium Sulfate", "Magnesium Citrate", "Bisacodyl", "Docusate Sodium", "Clonidine HCl", "Oxycodone", "D5W", "Metoprolol", "Nitroprusside Sodium", "D5 1/2NS", "Diltiazem", "Potassium Chl 20 mEq / 1000 mL D5 1/2 NS", "Syringe (IV Room)", "Methylprednisolone Na Succ.", "Ganciclovir", "Oxycodone (Sustained Release)", "Diltiazem Extended-Release", "Heparin Flush CVL  (100 units/ml)", "Pantoprazole", "*NF* Basiliximab", "NS", "Calcium Gluconate", "Propofol", "Vancomycin HCl", "Iso-Osmotic Dextrose", "Pantoprazole Sodium", "Humulin-R Insulin", "Gabapentin", "Fluconazole", "Heparin", "Sulfameth/Trimethoprim SS", "Haloperidol", "Nitroglycerin", "Fentanyl Citrate", "Albuterol Neb Soln", "Valganciclovir HCl", "Methylprednisolone Na Succ", "Unasyn", "Phenylephrine HCl", "Hydralazine HCl", "Ketorolac", "Hydromorphone", "Potassium Chl 40 mEq / 1000 mL D5 1/2 NS", "Guaifenesin", "Levofloxacin", "Nystatin Oral Suspension", "Methadone HCl", "traZODONE HCl", "Docusate Sodium (Liquid)", "Lansoprazole Oral Suspension", "Vecuronium Bromide", "Etomidate", "Succinylcholine", "1/2 NS", "Soln.", "Heparin Sodium", "Sodium Bicarbonate", "Alteplase (Catheter Clearance)", "Tacrolimus", "Piperacillin-Tazobactam Na", "Aspirin", "Clopidogrel Bisulfate", "Albumin 25% (12.5gm)", "Metoclopramide", "Mineral Oil", "Acetaminophen"], "def": ["Ipratropium Bromide Neb is a muscarinic antagonist commonly used for bronchial disorders, rhinitis, and as an antiarrhythmic, and it is also a component of the combination medication Duoneb used to treat chronic obstructive pulmonary disease (COPD).", "Furosemide is a loop diuretic commonly used to treat edema and chronic renal insufficiency, and it may also be used for the treatment of high blood pressure.", "", "Potassium chloride is a metal halide salt used in medicine that can be dissolved in water and has a salt-like taste, and it is important for maintaining cellular potassium levels and sodium transport.", "Dextrose 50% is a commonly used intravenous sugar solution that is administered for nutritional supplementation or to regulate glucose levels in individuals with metabolic disorders.", "Zolpidem Tartrate, also known as Ambien, is a hypnotic drug approved by the FDA in 1992 that improves sleep in patients with insomnia by decreasing sleep latency, increasing sleep duration, and reducing awakenings during sleep.", "Insulin is a short-acting peptide hormone produced by beta cells of the pancreas that promotes glucose metabolism, regulates the absorption of glucose into cells, inhibits hepatic glucose production, enhances protein synthesis, and is used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes.", "Morphine sulfate is a potent analgesic derived from opium that is commonly used for chronic pain management, but its use is limited due to the risk of tolerance, withdrawal symptoms, and abuse, and it is also the precursor to other opioids.", "The study found that Iminoral, the generic microemulsion of Cyclosporine, is safe and effective in preventing acute rejection episodes in adult patients after renal transplant, with similar outcomes to the innovator medication Neoral.", "Diphenhydramine HCl, commonly known as Benadryl, is a first-generation antihistamine used for the treatment of allergies, insomnia, symptoms of the common cold, and has sedative properties, but caution should be exercised due to its potential for causing drowsiness and sedation.", "Prednisone is a glucocorticoid medication commonly used to suppress the immune system, decrease inflammation, and treat various conditions such as asthma, COPD, rheumatologic diseases, high blood calcium due to cancer, and adrenal insufficiency.", "Mycophenolate Mofetil is an immunosuppressant medication commonly used to prevent rejection after organ transplantation and to treat autoimmune conditions, such as Crohn's disease and lupus, with the suspension form showing higher plasma concentration and lower risk of rejection and adverse events in liver transplant recipients.", "Multivitamin IV is a prescription that contains thiamine (vitamin B1) and other vitamins and minerals, which play important roles in intracellular glucose metabolism, energy conversion, and maintaining proper functioning of the heart, nervous, and digestive systems.", "The compatibility and safety of a safflower oil soybean oil lipid emulsion with amino acids and dextrose in total nutrient admixtures were studied, and all TNAs retained a uniform, milk-like appearance at all storage times.", "Oxycodone-Acetaminophen is a combination medication used to treat moderate to severe pain, but it has been implicated in deaths due to acetaminophen overdose and associated liver damage.", "Magnesium sulfate is a chemical compound commonly used for tocolysis in the management of preterm labor, and while it may cause alterations in mental status, it does not significantly affect maternal mental status during infusion.", "Magnesium citrate is a low volume and osmotic cathartic agent that is considered an approved inactive ingredient for drug products and an active ingredient in over-the-counter products, and it contains 11.23% magnesium by weight.", "Bisacodyl is a stimulant laxative used for the treatment of constipation and stimulation of bowel movement, and it works directly on the colon to produce a bowel movement.", "Docusate Sodium is a commonly prescribed stool softener and laxative for the treatment of constipation, although its effectiveness remains unclear and it may not alleviate associated symptoms such as abdominal cramps.", "Clonidine HCl is a centrally-acting alpha-2 adrenergic agonist that is used for the management of various conditions including hypertension, severe cancer pain, migraines, dysmenorrhea, menopausal symptoms, opiate and alcohol withdrawal, nicotine dependence, glaucoma, and attention-deficit hyperactivity disorder (ADHD).", "Oxycodone is a highly potent and addictive semisynthetic opioid used for the management of moderate to severe pain, available in immediate-release and extended-release formulations, and commonly abused.", "D5W, a form of dextrose 5% in water, is commonly used intravenously to replace lost fluids, provide carbohydrates, and treat low blood sugar or water loss without electrolyte loss in various medical conditions.", "Metoprolol is a widely prescribed selective beta-1 blocker medication used to treat high blood pressure, chest pain, fast heart rate, and prevent further heart problems after a heart attack, with different formulations available for immediate or extended release.", "Nitroprusside Sodium is a medication used to lower blood pressure in patients experiencing a hypertensive emergency, certain types of heart failure, and during surgery to decrease bleeding, and it can be substituted with alternative drugs like clevidipine or nicardipine to address the issue of hyperinflation.", "The prescription 'D5 1/2NS' is a solution used to treat low blood sugar or water loss without electrolyte loss, and it may decrease brain edema without altering neurological severity score or mortality rate after closed head trauma in rats.", "Diltiazem is a benzothiazepine derivative that acts as a calcium channel blocker and is used to treat high blood pressure, angina, certain heart arrhythmias, and hyperthyroidism when beta blockers cannot be used.", "The prescription 'Potassium Chl 20 mEq / 1000 mL D5 1/2 NS' can potentially cause severe hyperkalemia, especially in elderly hospitalized patients, and should be monitored closely for adverse effects.", "The prescription for 'Syringe (IV Room)' involves the use of ready to administer (RTA) syringes, specifically comparing the waste percentage between RTA syringes prepared through aseptic batchwise filling and RTA prefilled sterilized syringes (PFSSs) in the Intensive Care Unit (ICU), with the introduction of PFSSs significantly reducing drug waste and enhancing environmental sustainability.", "Methylprednisolone Na Succ. is a water-soluble ester of methylprednisolone used for cardiac, allergic, and hypoxic emergencies, and it has been shown to be effective in treating myasthenia gravis by improving immunity and quality of life while having a lower incidence of adverse drug reactions compared to high dose pulse therapy.", "Ganciclovir is an antiviral medication used to treat cytomegalovirus infections, particularly in severely immunocompromised individuals, and has also shown effectiveness in treating other herpesvirus infections.", "Oxycodone (Sustained Release) is a potent and addicting narcotic analgesic that was approved for daily, around-the-clock pain management in April 2016, and it has been found to be a cost-effective option compared to morphine for moderate to severe cancer pain titration in China.", "Diltiazem Extended-Release is a calcium channel blocker medication used to treat high blood pressure, angina, and certain heart arrhythmias, but incomplete ingestion of the medication can lead to an inflammatory mass causing possible acute airway compromise.", "The study compared heparin flush solution with 0.9% sodium chloride flush solution for central venous catheter lumen patency and found that both solutions have similar rates of lumen nonpatency, suggesting that 0.9% sodium chloride may be preferred for short-term use central venous catheter maintenance due to potential safety concerns with heparin.", "Pantoprazole is a first-generation proton pump inhibitor that is commonly used for the treatment of gastroesophageal reflux disease (GERD) and other disorders requiring a decrease in gastric acid secretion, and it is available in various forms including oral capsules, oral suspension, and intravenous injection.", "Basiliximab is a recombinant chimeric monoclonal antibody that functions as an immunosuppressive agent by blocking the interleukin-2 receptor a-chain on activated T-lymphocytes, and it has been shown to be superior to ruxolitinib in the treatment of steroid refractory acute graft versus host disease and in the prophylaxis of chronic graft versus host disease.", "Chloroxylenol (NS) is an antiseptic and disinfectant agent commonly used for skin disinfection, cleaning surgical instruments, and wound-cleansing applications. It is effective against Gram positive bacteria and is listed as an essential medicine by the World Health Organization.", "Calcium gluconate is a calcium salt used as a mineral supplement and medication, primarily administered through injection to treat low blood calcium, high blood potassium, and magnesium toxicity.", "Propofol, also known as Diprivan, is a commonly used intravenous medication for anesthesia induction and maintenance, known for its rapid onset, short duration of action, and minimal side effects despite challenges associated with its oil emulsion formulation.", "Vancomycin HCl is a glycopeptide antibiotic used to treat various bacterial infections, including complicated skin infections, bloodstream infections, endocarditis, bone and joint infections, and meningitis caused by methicillin-resistant Staphylococcus aureus, and its stability remains within the acceptable range when stored at room temperature or under refrigeration for up to 30 days.", "The use of Iso-Osmotic Dextrose (D5NS) in rats with closed head trauma (CHT) decreased brain edema without changing neurological severity score (NSS) or mortality rate (MR), suggesting its potential benefit in managing CHT-related complications.", "Pantoprazole Sodium is a first-generation proton pump inhibitor (PPI) that is commonly used for the initial treatment and maintenance therapy of gastroesophageal reflux disease (GERD), as well as for managing other disorders requiring a decrease in gastric acid secretion.", "Humulin-R Insulin is a short-acting form of insulin used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes, and it promotes glucose metabolism, inhibits hepatic glucose production, enhances protein synthesis, and inhibits lipolysis and proteolysis among other functions.", "Gabapentin, also known as Neurontin, is an anticonvulsant medication primarily used to treat epilepsy and neuropathic pain, with a relatively mild side-effect profile and potential benefits for anxiety and depression.", "Fluconazole is an antifungal medication that is highly effective for treating a variety of fungal infections and can be safely desensitized in selected patients.", "Heparin is a low molecular weight anticoagulant derived from porcine intestinal mucosa, used for the prevention of postoperative venous thrombosis and also in the treatment of heart attacks and unstable angina.", "Sulfameth/Trimethoprim SS is a pyrimidine inhibitor of dihydrofolate reductase that is commonly used as an antibacterial, but can also cause aseptic meningitis as a rare adverse reaction.", "Haloperidol is a traditional antipsychotic medication primarily used to treat schizophrenia and other psychoses, as well as schizoaffective disorder, delusional disorders, ballism, Tourette syndrome, and intractable hiccups, with potential adverse effects such as extrapyramidal symptoms and cognitive impairments.", "Nitroglycerin is a volatile vasodilator that relieves angina pectoris by stimulating guanylate cyclase, lowering cytosolic calcium, and is commonly used in the manufacture of explosives.", "Fentanyl Citrate is a highly potent narcotic analgesic primarily used for pain management in cancer patients and those recovering from painful surgical operations, but it can also lead to habituation or addiction and is sometimes used as a sedative.", "The study compared the efficacy of extended release oral albuterol sulfate to inhaled salmeterol in the treatment of nocturnal asthma and found that both medications resulted in similar improvements in morning peak expiratory flow, overnight change in PEF values, and control of nocturnal asthma symptoms.", "Valganciclovir HCl is an antiviral medication used to treat cytomegalovirus infections, often taken long term to suppress the infection, and a newly developed osmotic formulation with a single dose of 450 mg has shown controlled zero order release for 24 hours, reducing dosing frequency and associated side effects.", "Methylprednisolone Na Succ is a water-soluble ester of methylprednisolone used for cardiac, allergic, and hypoxic emergencies, but its use should be judicious in patients with intact healthy articular cartilage due to its chondrotoxic effects.", "Unasyn is a combination medication of ampicillin and sulbactam, where sulbactam acts as a β-lactamase inhibitor to prevent the destruction of antibiotic activity by bacteria.", "Phenylephrine HCl is a sympathomimetic amine primarily used to treat nasal congestion, but it can also be effective in treating hypotension, shock, hypotension during spinal anesthesia, paroxysmal supraventricular tachycardia, hemorrhoids, and as an aid in diagnosing heart murmurs.", "Hydralazine HCl is a direct-acting vasodilator commonly used as an antihypertensive agent and for the treatment of high blood pressure, heart failure, and acute lymphocytic leukemia.", "Ketorolac is a nonsteroidal anti-inflammatory drug (NSAID) commonly used for pain management in various conditions such as postoperative pain, rheumatoid arthritis, osteoarthritis, menstrual disorders, headaches, spinal and soft tissue pain, and ankylosing spondylitis, with potential side effects including sleepiness, dizziness, abdominal pain, swelling, and nausea.", "Hydromorphone is a pure opioid derived from morphine, commonly used to treat moderate to severe pain, particularly in cancer patients, and has a high potency and comparable side effect profile to morphine.", "The prescription 'Potassium Chl 40 mEq / 1000 mL D5 1/2 NS' may cause severe hyperkalemia, especially in elderly hospitalized patients, and should be considered as a potential adverse effect.", "Guaifenesin is an expectorant medication used to eliminate sputum from the respiratory tract and relieve chest congestion, with extended-release formulations offering a convenient 12-hour dosing alternative to immediate-release formulations.", "Levofloxacin is a synthetic fluoroquinolone antibiotic that inhibits bacterial DNA replication and is commonly used to treat various bacterial infections, including sinusitis, pneumonia, urinary tract infections, and gastroenteritis, with established efficacy and safety in both adults and children.", "Nystatin Oral Suspension is a relatively safe and effective antifungal drug used to treat oral or gastrointestinal fungal infections, including Candida spp., and is not absorbed across intact skin or mucous membranes.", "Methadone HCl is a synthetic opioid agonist used for chronic pain and opioid use disorder, providing relief from cravings and withdrawal symptoms.", "Trazodone HCl is an antidepressant medication commonly used to treat major depressive disorder, anxiety disorders, and sleep difficulties, with common side effects including dry mouth, faintness, vomiting, and headache.", "Docusate Sodium (Liquid) is a stool softener commonly used for the treatment of constipation, but its effectiveness in increasing stool frequency and softening remains unclear, and it does not alleviate associated symptoms such as abdominal cramps.", "Lansoprazole Oral Suspension is a medication that effectively controls intragastric pH, is bioequivalent to the intact capsule, and is a suitable option for patients who have difficulty swallowing or are unable to swallow lansoprazole capsules.", "Vecuronium Bromide is a non-depolarizing neuromuscular blocking agent used in general anesthesia to provide skeletal muscle relaxation during surgery or mechanical ventilation, with advantages over other agents due to its lack of significant cardiovascular effects, easy reversibility, and shorter duration of action.", "Etomidate is a short-acting intravenous anesthetic and hypnotic used for the induction of general anesthesia and sedation for short procedures, with potential side effects including venous pain on injection and skeletal muscle movements.", "Succinylcholine is a quaternary skeletal muscle relaxant commonly used in surgical and anesthetic procedures to induce short-term muscle relaxation, but its use is associated with fasciculation and myalgia, which can be reduced by preoperative administration of gabapentinoids.", "The prescription '1/2 NS' refers to a low cost and high yield method of obtaining ZnOHF ZnO based 2D nanostars (NSs) through chemical bath deposition, which can be used as active materials for water splitting and green hydrogen production.", "The prescription 'Soln.' may refer to Solnechnogorsk, a town in Russia, or Solanum nigrum, an edible medicinal herb with various therapeutic potential including antitumor, anti-inflammatory, antioxidant, antibacterial, and neuroprotective activities.", "Heparin Sodium is a heterogenous preparation of anionic, sulfated glycosaminoglycan polymers that acts as an anticoagulant by binding to antithrombin III and inactivating coagulation enzymes, but it requires continuous infusions and monitoring of activated partial prothrombin time, and has a higher risk of bleeding and osteoporosis in long-term use.", "Sodium bicarbonate is a white, crystalline powder commonly used as a pH buffering agent, electrolyte replenisher, systemic alkalizer, and in topical cleansing solutions, and its use for the treatment of severe metabolic acidaemia remains controversial.", "Alteplase, a glycosylated human tissue plasminogen activator, has been found to be equally effective in clearing occluded peripherally inserted central catheter (PICC) lines when administered in either standard or intraluminal volume doses, but the use of intraluminal volume dose alteplase is more cost-effective.", "Tacrolimus is an immunosuppressive drug commonly used after organ transplant to reduce the risk of organ rejection, and it is also used topically for the treatment of severe atopic dermatitis, refractory uveitis, and vitiligo.", "Piperacillin-Tazobactam Na is a broad-spectrum β-lactam antibiotic that inhibits the action of bacterial beta-lactamases, providing multi-resistance to various beta-lactam antibiotics and remaining active against Pseudomonas aeruginosa.", "Aspirin, also known as acetylsalicylic acid, is a nonsteroidal anti-inflammatory drug commonly used for pain relief, fever reduction, inflammation reduction, and as an antithrombotic, but it may cause more harm than benefit for primary prevention of atherosclerotic cardiovascular disease.", "Clopidogrel Bisulfate, sold under the brand name Plavix, is an antiplatelet medication used to inhibit blood clots in conditions such as peripheral vascular disease, coronary artery disease, and cerebrovascular disease, but it is associated with serious adverse drug reactions and its effectiveness may be influenced by genetic variations.", "Albumin 25% (12.5gm) is a prescription medication that contains human serum albumin, which is the primary protein in human blood plasma and plays a crucial role in maintaining the oncotic pressure of blood and binding to various substances in the body.", "Metoclopramide is a dopamine D2 antagonist commonly used as an antiemetic and for the treatment of stomach and esophageal problems, including nausea, vomiting, delayed stomach emptying, and gastroesophageal reflux disease, with potential side effects such as fatigue, diarrhea, and restlessness.", "Mineral oil, derived from petroleum, is a colorless and odorless mixture of higher alkanes that is commonly used in cosmetic products due to its skin tolerance and non-allergenic properties, with no reported significant adverse effects on the skin or internal organs when topically applied or ingested in small amounts.", "Acetaminophen, also known as paracetamol, is a widely used non-opioid analgesic and antipyretic medication, commonly used to treat fever and mild to moderate pain, but caution should be exercised to avoid overdose or repeated supratherapeutic ingestion as it can cause acute liver injury."]}, "procedure": {"idxs": ["5059", "8622", "3950", "0093", "5011", "8659", "3893", "4513", "966", "3990", "9910"], "name": ["Liver transplant NEC", "Exc wound debridement", "Angio oth non-coronary", "Transplant cadaver donor", "Closed liver biopsy", "Skin closure NEC", "Venous cath NEC", "Sm bowel endoscopy NEC", "Entral infus nutrit sub", "Ins non-d-e non-cor stnt", "Inject/inf thrombo agent"], "def": ["The procedure_id 'Liver transplant NEC' refers to a health condition related to the transplantation of a liver, which can be useful for health phenotyping tasks.", "The procedure_id 'Exc wound debridement' refers to the process of removing damaged or infected tissue from a wound, which is important information for health phenotyping tasks.", "The procedure_id 'Angio oth non-coronary' refers to a health condition known as Angio other than non-coronary, which is relevant for health phenotyping tasks.", "The procedure_id 'Transplant cadaver donor' refers to a health-related procedure involving the transplantation of organs or tissues from a deceased donor to a recipient.", "The procedure_id 'Closed liver biopsy' refers to a health procedure involving the extraction of liver tissue for diagnostic purposes.", "The procedure_id 'Skin closure NEC' refers to a health condition related to the closure of the skin, which can be valuable information for health phenotyping tasks.", "The disease name 'Venous cath NEC' refers to a health condition related to the insertion of a catheter into a vein, which could be valuable information for health phenotyping tasks.", "The procedure 'Sm bowel endoscopy NEC' is a health-related phenotyping task that involves examining the small bowel for any abnormalities or diseases.", "The procedure_id 'Entral infus nutrit sub' refers to the administration of nutritional substances through the enteral route, which is relevant for health phenotyping tasks related to nutritional support.", "The procedure_id 'Ins non-d-e non-cor stnt' is associated with a disease called Ins non-d-e non-cor stnt, which is relevant information for health phenotyping task.", "The procedure_id 'Inject/inf thrombo agent' refers to the administration of a thrombolytic agent through injection or infusion, which is relevant for health phenotyping tasks related to thrombosis treatment."]}, "label": ["1", "1", "0", "0", "0", "0", "1", "0", "0", "0", "1", "1", "0", "1", "1", "0", "1", "1", "0", "0", "0", "1", "0", "1", "0"]}
{"disease": {"idxs": ["553", "300", "311", "482", "516", "428", "530", "733", "272", "401", "244"], "name": ["Other hernia of abdominal cavity without mention of obstruction or", "Neurotic disorders", "Depressive disorder, not elsewhere classified", "Other bacterial pneumonia", "Other alveolar and parietoalveolar pneumonopathy", "Heart failure", "Diseases of esophagus", "Other disorders of bone and cartilage", "Disorders of lipoid metabolism", "Essential hypertension", "Acquired hypothyroidism"], "def": ["Other hernia of abdominal cavity without mention of obstruction or is a condition characterized by the abnormal protrusion of abdominal structures through the abdominal wall, including groin hernias and ventral hernias, with symptoms that can vary and may spontaneously reduce.", "Neurotic disorders are distressing mental disorders recognized by the individual as unacceptable, affecting social relationships within acceptable limits, and are often caused by past anxiety or anxiety-related conditions.", "Depressive disorder, not elsewhere classified, is an affective disorder characterized by a dysphoric mood or loss of interest in usual activities, and it can result in emotional, behavioral, and health problems affecting various aspects of life.", "Other bacterial pneumonia is a type of pneumonia caused by bacterial infection, with Streptococcus pneumoniae being the most common bacterial cause in all age groups except newborn infants.", "Other alveolar and parietoalveolar pneumonopathy is a disease characterized by dense phospholipoproteinaceous deposits in the alveoli, impaired processing of pulmonary surfactants, and potential complications related to autoimmune reactions.", "Heart failure is a heterogeneous condition characterized by the heart's inability to pump sufficient blood, resulting in symptoms such as shortness of breath, fatigue, swelling, and decreased exercise tolerance, and it can be caused by structural defects, functional abnormalities, or sudden overload.", "\"Diseases of the esophagus encompass a range of pathological processes, including infectious esophagitis, Barrett's esophagus (a premalignant condition), and esophageal motor disorders, which can cause dysphagia and other symptoms.\"", "Other disorders of bone and cartilage involve pathological processes in the chondral tissue, an increased number of benign cartilage lesions that can transform into chondrosarcoma, and the importance of long bones, particularly the femur and tibia, for skeletal mobility.", "Disorders of lipoid metabolism involve abnormal anabolism or catabolism of lipids in the body, including fatty acid oxidation disorders and X linked adrenoleukodystrophy, which is characterized by the accumulation of very long chain fatty acids and affects cholesterol metabolism.", "Essential hypertension, also known as primary hypertension, is the most common type of high blood pressure that develops gradually over time without a known cause, affecting 85% of those with high blood pressure, and is associated with increased risk of cardiovascular disease.", "Acquired hypothyroidism is a condition that can be caused by genetic or environmental factors, such as thyroid dysgenesis or hypothyroidism in infants of mothers treated with thiouracil during pregnancy, and it can lead to severe mental retardation, impaired skeletal development, short stature, and myxedema."]}, "prescription": {"idxs": ["54", "11", "125", "144", "55", "97", "110", "156", "21", "1237", "576", "211", "94", "16", "8", "4", "44", "20", "155", "431", "451", "669", "286", "715", "9", "180", "124", "214", "210", "261", "28", "206", "27", "15", "50", "82", "56", "456", "148"], "name": ["Levothyroxine Sodium", "Zolpidem Tartrate", "Sodium Chloride 0.9%  Flush", "Ondansetron", "Heparin", "Atorvastatin", "Pneumococcal Vac Polyvalent", "OxycoDONE (Immediate Release) ", "Acetaminophen", "Doxepin HCl", "Fluticasone-Salmeterol Diskus (250/50) ", "Albuterol 0.083% Neb Soln", "Ipratropium Bromide Neb", "Potassium Chloride", "Docusate Sodium", "Furosemide", "Levofloxacin", "Iso-Osmotic Dextrose", "Vancomycin", "Piperacillin-Tazobactam", "0.9% Sodium Chloride (Mini Bag Plus)", "Duloxetine", "Omeprazole", "Glucagon", "Insulin", "Dextrose 50%", "LR", "Midazolam", "5% Dextrose", "Phenylephrine", "Calcium Gluconate", "0.9% Sodium Chloride", "SW", "Magnesium Sulfate", "Clonazepam", "Bisacodyl", "Senna", "Heparin Flush (10 units/ml)", "HYDROmorphone (Dilaudid)"], "def": ["Levothyroxine Sodium is a synthetic form of the thyroid hormone thyroxine used to treat thyroid hormone deficiency and certain types of thyroid tumors, but overdose can lead to symptoms such as lethargy, tremors, body temperature dysregulation, orthostatic hypotension, and diarrhea, and may exacerbate underlying psychiatric symptoms.", "Zolpidem Tartrate, also known as Ambien, is a hypnotic drug approved by the FDA in 1992 that improves sleep in patients with insomnia by decreasing sleep latency, increasing sleep duration, and reducing awakenings during sleep.", "Sodium chloride 0.9% flush is a commonly used and safe solution for flushing and locking peripheral intravenous access devices, as it does not increase the risks of occlusion or other adverse events, and is as effective as heparin saline solution.", "Ondansetron is a medication used to prevent nausea and vomiting caused by cancer chemotherapy, radiation therapy, or surgery, and it can also be effective for treating gastroenteritis, with various administration options available including oral, intramuscular, and intravenous.", "Heparin is a low molecular weight anticoagulant derived from porcine intestinal mucosa, used for the prevention of postoperative venous thrombosis and also in the treatment of heart attacks and unstable angina.", "Atorvastatin is a statin medication used to prevent cardiovascular disease and treat abnormal lipid levels, and it has been compared to other medications in terms of efficacy and tolerability.", "The Pneumococcal Vac Polyvalent is an active immunization vaccine for intramuscular or subcutaneous injection against pneumococcal disease, including pneumonia and bacteremia, and is widely used in high-risk adults.", "OxycoDONE (Immediate Release) is a strong, semi-synthetic opioid commonly prescribed for moderate to severe pain management, but it is highly addictive and commonly abused, making it important to monitor its usage for health phenotyping purposes.", "Acetaminophen, also known as paracetamol, is a widely used non-opioid analgesic and antipyretic medication, commonly used to treat fever and mild to moderate pain, but caution should be exercised to avoid overdose or repeated supratherapeutic ingestion as it can cause acute liver injury.", "Doxepin HCl is a tricyclic antidepressant that is structurally similar to phenothiazines and acts as a potent inhibitor of serotonin and norepinephrine reuptake, with indications for treating depression, insomnia, chronic pain, anxiety, idiopathic urticaria, and certain types of eczema.", "Fluticasone-Salmeterol Diskus (250/50) is a fixed-dose combination medication containing fluticasone propionate and salmeterol, used for the management of asthma and chronic obstructive pulmonary disease, with common side effects including thrush, headache, and cough.", "The study compared the efficacy and patient acceptability of bambuterol and controlled release salbutamol in treating nocturnal asthma, showing that both treatments were equally effective and well-tolerated, with some patients preferring bambuterol due to its better adverse effect profile and once-daily regimen.", "Ipratropium Bromide Neb is a muscarinic antagonist commonly used for bronchial disorders, rhinitis, and as an antiarrhythmic, and it is also a component of the combination medication Duoneb used to treat chronic obstructive pulmonary disease (COPD).", "Potassium chloride is a metal halide salt used in medicine that can be dissolved in water and has a salt-like taste, and it is important for maintaining cellular potassium levels and sodium transport.", "Docusate Sodium is a commonly prescribed stool softener and laxative for the treatment of constipation, although its effectiveness remains unclear and it may not alleviate associated symptoms such as abdominal cramps.", "Furosemide is a loop diuretic commonly used to treat edema and chronic renal insufficiency, and it may also be used for the treatment of high blood pressure.", "Levofloxacin is a synthetic fluoroquinolone antibiotic that inhibits bacterial DNA replication and is commonly used to treat various bacterial infections, including sinusitis, pneumonia, urinary tract infections, and gastroenteritis, with established efficacy and safety in both adults and children.", "The use of Iso-Osmotic Dextrose (D5NS) in rats with closed head trauma (CHT) decreased brain edema without changing neurological severity score (NSS) or mortality rate (MR), suggesting its potential benefit in managing CHT-related complications.", "Vancomycin is a glycopeptide antibiotic used to treat various bacterial infections, including complicated skin infections, bloodstream infections, endocarditis, bone and joint infections, and meningitis caused by methicillin-resistant Staphylococcus aureus, and therapeutic drug monitoring is recommended to optimize therapy and prevent nephrotoxicity.", "Piperacillin-Tazobactam is a combination medication containing the antibiotic piperacillin and the β-lactamase inhibitor tazobactam, which is used to treat various bacterial infections and has been evaluated for its safety in comparison to cefepime in a randomized clinical trial.", "The prescription '0.9% Sodium Chloride (Mini Bag Plus)' is a commonly used solution containing sodium chloride, which is an essential compound responsible for the salinity of bodily fluids and seawater, and it has been found to be stable for 30 days under various storage conditions.", "Duloxetine is a medication primarily used to treat major depressive disorder, generalized anxiety disorder, pain related to diabetic peripheral neuropathy, and stress urinary incontinence, and it is known to be a serotonin-norepinephrine reuptake inhibitor with common side effects including dry mouth, nausea, fatigue, dizziness, agitation, sexual problems, and increased sweating.", "Omeprazole is a medication commonly used to treat gastroesophageal reflux disease, peptic ulcer disease, and Zollinger-Ellison syndrome, and it can be administered orally or rectally in infants with pathological GERD.", "Glucagon is a peptide hormone produced by the pancreas that raises glucose and fatty acid levels in the bloodstream, playing a crucial role in metabolism and potentially offering therapeutic applications for the treatment of metabolic disorders.", "Insulin is a short-acting peptide hormone produced by beta cells of the pancreas that promotes glucose metabolism, regulates the absorption of glucose into cells, inhibits hepatic glucose production, enhances protein synthesis, and is used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes.", "Dextrose 50% is a commonly used intravenous sugar solution that is administered for nutritional supplementation or to regulate glucose levels in individuals with metabolic disorders.", "LR is a disease that involves long latency reflexes (LLRs) which are late responses in nerve conduction studies, providing a measure of proximal nerve and central conduction, and can be used for evaluating central nervous system or proximal peripheral nerve disorders.", "Midazolam is a benzodiazepine medication used for anesthesia, procedural sedation, and treating severe agitation, working by inducing sleepiness, decreasing anxiety, and causing a loss of ability to create new memories.", "The prescription '5% Dextrose' is a glucose solution commonly used for nutritional supplementation or metabolic disorders where glucose levels are improperly regulated, and it is listed as an essential medicine by the World Health Organization.", "Phenylephrine is an alpha- and beta-adrenergic agonist that is used to treat various disorders such as asthma, heart failure, rhinitis, urinary incontinence, narcolepsy, and depression, and it can also be used as a nasal decongestant, to dilate the pupil, increase blood pressure, relieve hemorrhoids, and reduce bleeding associated with certain medical procedures.", "Calcium gluconate is a calcium salt used as a mineral supplement and medication, primarily administered through injection to treat low blood calcium, high blood potassium, and magnesium toxicity.", "0.9% Sodium Chloride, also known as salt, is an essential medicine listed by the World Health Organization and is responsible for the salinity of seawater and extracellular fluid in organisms.", "", "Magnesium sulfate is a chemical compound commonly used for tocolysis in the management of preterm labor, and while it may cause alterations in mental status, it does not significantly affect maternal mental status during infusion.", "Clonazepam is a benzodiazepine medication used to treat various seizures and panic disorder, and its mechanism of action involves enhancing gamma-aminobutyric acid receptor responses.", "Bisacodyl is a stimulant laxative used for the treatment of constipation and stimulation of bowel movement, and it works directly on the colon to produce a bowel movement.", "Senna is a medication used to treat constipation and empty the large intestine before surgery, and it has been found to inhibit the ribonuclease H activity of HIV reverse transcriptase.", "Heparin Flush (10 units/ml) is a medication used as an anticoagulant in the treatment of heart attacks and unstable angina, and there is no significant difference in catheter longevity when compared to saline flush.", "Hydromorphone (Dilaudid) is an opioid analgesic used to treat moderate to severe pain, including pain in obstetrics, and as an adjunct to anesthesia, but it has been requested to be removed from the market due to opioid misuse and abuse risks associated with its injectable reformulation."]}, "procedure": {"idxs": ["4467", "5383", "3893", "3891"], "name": ["Lap creat esoph sphinct", "Lap thorc app-diaph hern", "Venous cath NEC", "Arterial catheterization"], "def": ["The procedure 'Lap creat esoph sphinct' is related to a disease called Laparoscopic creation of esophageal sphincter, which could be valuable information for health phenotyping tasks.", "The procedure_id 'Lap thorc app-diaph hern' refers to a surgical procedure for treating a condition called Laparoscopic Thoracic Approach to Diaphragmatic Hernia, which can be relevant for health phenotyping tasks.", "The disease name 'Venous cath NEC' refers to a health condition related to the insertion of a catheter into a vein, which could be valuable information for health phenotyping tasks.", "Arterial catheterization is a procedure used in health phenotyping tasks that involves the insertion of a catheter into an artery to monitor blood pressure and collect blood samples."]}, "label": ["0", "0", "1", "0", "0", "1", "1", "0", "1", "1", "0", "0", "1", "1", "1", "1", "1", "0", "1", "0", "0", "0", "0", "0", "0"]}
{"disease": {"idxs": ["427", "997", "426", "250", "416", "414"], "name": ["Cardiac dysrhythmias", "Complications affecting specified body system not elsewhere classified", "Conduction disorders", "Diabetes mellitus", "Chronic pulmonary heart disease", "Other forms of chronic ischemic heart disease"], "def": ["Cardiac dysrhythmias, also known as arrhythmias, are irregularities in the heartbeat that can manifest as a fast or slow heart rate, and may cause symptoms such as chest pain, shortness of breath, and dizziness.", "Complications affecting specified body systems not elsewhere classified can arise from various diseases, including diabetes mellitus, surgical procedures, and diseases of the digestive system, leading to pathological processes in multiple organs and tissues such as the eye, kidney, blood vessels, and nerve tissue.", "Conduction disorders refer to pathological irregularities in the heart's conduction system, which can be associated with other heart diseases and syndromes, and may result from injuries, affecting the coordinated and normal rhythm of the heart's contractions and blood circulation.", "Diabetes mellitus is a group of metabolic disorders characterized by high blood sugar levels, insulin deficiency or unresponsiveness, and various complications such as cardiovascular disease, kidney disease, and infections.", "Chronic pulmonary heart disease, also known as cor pulmonale, is the enlargement and failure of the right ventricle of the heart caused by pulmonary hypertension, often associated with chronic obstructive pulmonary disease and pulmonary embolism, and can result in respiratory failure and right ventricular hypertrophy.", "Chronic ischemic heart disease is associated with peripheral artery disease, heart failure, and the potential for early stage detection of chronic kidney diseases, which may be treated through the regulation of NAD biosynthesis and the use of nanoparticles for targeted delivery of non coding RNAs or NAD metabolites."]}, "prescription": {"idxs": ["13", "22", "110", "9", "219", "218", "180", "715", "286", "1818", "16", "365", "15", "206", "109", "529", "125", "1", "4", "21", "14", "182", "118"], "name": ["Nitroglycerin SL", "Oxycodone-Acetaminophen", "Pneumococcal Vac Polyvalent", "Insulin", "Amiodarone", "MetFORMIN (Glucophage)", "Dextrose 50%", "Glucagon", "Omeprazole", "Pioglitazone", "Potassium Chloride", "Bag", "Magnesium Sulfate", "0.9% Sodium Chloride", "Lisinopril", "Metoprolol Succinate XL", "Sodium Chloride 0.9%  Flush", "Warfarin", "Furosemide", "Acetaminophen", "Lorazepam", "Rosuvastatin Calcium", "Aspirin"], "def": ["Nitroglycerin SL is a volatile vasodilator used to relieve angina pectoris by stimulating guanylate cyclase and lowering cytosolic calcium, and its administration before radial artery puncture can improve cannulation success and decrease the incidence of radial artery spasm in transradial procedures.", "Oxycodone-Acetaminophen is a combination medication used to treat moderate to severe pain, but it has been implicated in deaths due to acetaminophen overdose and associated liver damage.", "The Pneumococcal Vac Polyvalent is an active immunization vaccine for intramuscular or subcutaneous injection against pneumococcal disease, including pneumonia and bacteremia, and is widely used in high-risk adults.", "Insulin is a short-acting peptide hormone produced by beta cells of the pancreas that promotes glucose metabolism, regulates the absorption of glucose into cells, inhibits hepatic glucose production, enhances protein synthesis, and is used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes.", "Amiodarone is an antiarrhythmic drug that increases the duration of ventricular and atrial muscle action, decreases heart rate and vascular resistance, and is used to treat and prevent various types of cardiac dysrhythmias, although it may have potentially life-threatening side effects such as hepatotoxicity.", "MetFORMIN (Glucophage) is a widely prescribed antihyperglycemic medication of the biguanide class, primarily used for the management of type II diabetes and polycystic ovary syndrome, and is often combined with other drugs for optimal treatment outcomes.", "Dextrose 50% is a commonly used intravenous sugar solution that is administered for nutritional supplementation or to regulate glucose levels in individuals with metabolic disorders.", "Glucagon is a peptide hormone produced by the pancreas that raises glucose and fatty acid levels in the bloodstream, playing a crucial role in metabolism and potentially offering therapeutic applications for the treatment of metabolic disorders.", "Omeprazole is a medication commonly used to treat gastroesophageal reflux disease, peptic ulcer disease, and Zollinger-Ellison syndrome, and it can be administered orally or rectally in infants with pathological GERD.", "Pioglitazone is an anti-diabetic medication used to treat type 2 diabetes and can be used in combination with other drugs or insulin, along with exercise and diet.", "Potassium chloride is a metal halide salt used in medicine that can be dissolved in water and has a salt-like taste, and it is important for maintaining cellular potassium levels and sodium transport.", "Bagging treatment has been found to improve the appearance and quality of kiwifruit by increasing soluble solid content, carotenoid and anthocyanin levels, and decreasing chlorophyll levels, suggesting its potential benefits for health phenotyping.", "Magnesium sulfate is a chemical compound commonly used for tocolysis in the management of preterm labor, and while it may cause alterations in mental status, it does not significantly affect maternal mental status during infusion.", "0.9% Sodium Chloride, also known as salt, is an essential medicine listed by the World Health Organization and is responsible for the salinity of seawater and extracellular fluid in organisms.", "Lisinopril is a potent inhibitor of angiotensin-converting enzyme (ACE) used to treat hypertension, heart failure, and prevent kidney problems in patients with diabetes mellitus, and it may also improve survival following a heart attack.", "Metoprolol Succinate XL is a widely prescribed selective beta-1 blocker medication used to treat high blood pressure, chest pain, fast heart rate, and prevent further heart problems after a heart attack, with extended-release formulations available for controlled drug release.", "Sodium chloride 0.9% flush is a commonly used and safe solution for flushing and locking peripheral intravenous access devices, as it does not increase the risks of occlusion or other adverse events, and is as effective as heparin saline solution.", "Warfarin is an anticoagulant that inhibits coagulation by preventing carboxylation of vitamin K-dependent clotting factors, and it has been associated with accelerated calcification of aortic valve interstitial cells in patients with aortic stenosis.", "Furosemide is a loop diuretic commonly used to treat edema and chronic renal insufficiency, and it may also be used for the treatment of high blood pressure.", "Acetaminophen, also known as paracetamol, is a widely used non-opioid analgesic and antipyretic medication, commonly used to treat fever and mild to moderate pain, but caution should be exercised to avoid overdose or repeated supratherapeutic ingestion as it can cause acute liver injury.", "Lorazepam is a benzodiazepine medication with anticonvulsant, anxiolytic, sedative, muscle relaxant, and amnesic properties, commonly used to treat severe anxiety disorders, insomnia, alcohol withdrawal syndrome, and chemotherapy-induced nausea and vomiting.", "Rosuvastatin Calcium is a statin medication used to reduce plasma cholesterol levels, prevent cardiovascular disease, and has been shown to increase 25 hydroxyvitamin D levels.", "Aspirin, also known as acetylsalicylic acid, is a nonsteroidal anti-inflammatory drug commonly used for pain relief, fever reduction, inflammation reduction, and as an antithrombotic, but it may cause more harm than benefit for primary prevention of atherosclerotic cardiovascular disease."]}, "procedure": {"idxs": ["3734", "9960", "9962"], "name": ["Exc/des hrt les,endovasc", "Cardiopulm resuscita NOS", "Heart countershock NEC"], "def": ["The procedure 'Exc/des hrt les,endovasc' is related to the treatment of heart lesions using endovascular techniques.", "The procedure_id 'Cardiopulm resuscita NOS' refers to the medical procedure of cardiopulmonary resuscitation, which is relevant for health phenotyping tasks related to cardiac and respiratory conditions.", "The procedure 'Heart countershock NEC' is associated with a disease called Heart countershock NEC, which could be valuable information for health phenotyping tasks."]}, "label": ["0", "0", "0", "1", "0", "0", "1", "0", "0", "0", "1", "1", "1", "1", "1", "0", "1", "0", "0", "0", "0", "0", "0", "0", "0"]}
{"disease": {"idxs": ["414", "338", "719", "427", "401", "300", "311", "412", "287", "276", "511", "250", "285", "411", "458", "696"], "name": ["Other forms of chronic ischemic heart disease", "Pain, not elsewhere classified", "Other and unspecified disorders of joint", "Cardiac dysrhythmias", "Essential hypertension", "Neurotic disorders", "Depressive disorder, not elsewhere classified", "Old myocardial infarction", "Purpura and other hemorrhagic conditions", "Disorders of fluid, electrolyte, and acid-base balance", "Pleurisy", "Diabetes mellitus", "Other and unspecified anemias", "Other acute and subacute forms of ischemic heart disease", "Hypotension", "Psoriasis and similar disorders"], "def": ["Chronic ischemic heart disease is associated with peripheral artery disease, heart failure, and the potential for early stage detection of chronic kidney diseases, which may be treated through the regulation of NAD biosynthesis and the use of nanoparticles for targeted delivery of non coding RNAs or NAD metabolites.", "The disease 'Pain, not elsewhere classified' is a form of chronic pain that is non-localized and wide-reaching, and it may be associated with the development of fibromyalgia and impulse-control disorders. Additionally, the term 'sciatica' should be discouraged for use in clinical practice and research, and the term 'spine related leg pain' is proposed as an umbrella term to include various conditions associated with pain radiating from the spine into the leg.", "The disease 'Other and unspecified disorders of joint' involves joint diseases, hereditary conditions, and chronic arthropathy, particularly in individuals with haemophilia, where surgical and non-surgical interventions are controversial and require further research.", "Cardiac dysrhythmias, also known as arrhythmias, are irregularities in the heartbeat that can manifest as a fast or slow heart rate, and may cause symptoms such as chest pain, shortness of breath, and dizziness.", "Essential hypertension, also known as primary hypertension, is the most common type of high blood pressure that develops gradually over time without a known cause, affecting 85% of those with high blood pressure, and is associated with increased risk of cardiovascular disease.", "Neurotic disorders are distressing mental disorders recognized by the individual as unacceptable, affecting social relationships within acceptable limits, and are often caused by past anxiety or anxiety-related conditions.", "Depressive disorder, not elsewhere classified, is an affective disorder characterized by a dysphoric mood or loss of interest in usual activities, and it can result in emotional, behavioral, and health problems affecting various aspects of life.", "Old myocardial infarction, also known as inferior wall myocardial infarction, is often caused by occlusion of the right coronary artery and is commonly associated with coronary artery disease (atherosclerosis), which restricts blood flow; diagnosis involves integrating medical history, physical examination, electrocardiogram findings, cardiac markers, and coronary angiogram; embolic myocardial infarction is a rare but potentially fatal complication of infective endocarditis.", "Purpura and other hemorrhagic conditions, such as thrombotic thrombocytopenic purpura (TTP), are acquired or congenital disorders characterized by platelet aggregation, thrombosis, thrombocytopenia, hemolytic anemia, and potential end-organ damage, with mutations in the ADAMTS13 protein gene identified in familial cases.", "Patients with disorders of fluid, electrolyte, and acid-base balance may experience disturbances in acid-base equilibrium, electrolyte imbalances, dehydration, and impaired kidney function, which can lead to fluid shifts and metabolic alkalosis.", "Pleurisy is an inflammation of the pleura, the lining of the lungs, which can cause sharp chest pain and is associated with various underlying conditions such as viral or bacterial infections, autoimmune disorders, lung cancer, and trauma.", "Diabetes mellitus is a group of metabolic disorders characterized by high blood sugar levels, insulin deficiency or unresponsiveness, and various complications such as cardiovascular disease, kidney disease, and infections.", "Patients with Other and unspecified anemias may experience congenital hemolytic anemia, anemia associated with bone marrow disease, and anemia prevalent among patients with chronic kidney disease, with suboptimal adherence to treatment guidelines and monitoring of hemoglobin and iron deficiency.", "Other acute and subacute forms of ischemic heart disease, also known as acute coronary syndrome, can lead to myocardial infarction and result in heart muscles that don't function properly, either temporarily or permanently. It is the most common cardiovascular disease and is caused by the build-up of atherosclerotic plaque in the arteries of the heart.", "Hypotension, specifically orthostatic hypotension, is characterized by a significant drop in blood pressure upon standing and can lead to symptoms such as dizziness, blurred vision, and syncope, while also being a risk factor for cardiovascular diseases and complications.", "Psoriasis is a chronic, inflammatory skin disease characterized by erythematous, dry, scaling patches that can affect various parts of the body and is associated with an increased risk of developing other conditions such as psoriatic arthritis, eye conditions, obesity, type 2 diabetes, high blood pressure, cardiovascular disease, autoimmune diseases, and mental health conditions."]}, "prescription": {"idxs": ["98", "57", "8", "120", "957", "198", "715", "274", "180", "213", "961", "110", "456", "275", "244", "4", "144", "109", "16", "21", "9", "7", "1176", "28", "15", "126", "155", "245", "17", "931", "210", "128", "101", "206", "365", "148", "20", "125", "82", "167", "11", "13", "95", "207", "248", "127", "115", "114", "25", "118", "1217", "117", "24", "23", "22"], "name": ["Aspirin EC", "Ranitidine", "Docusate Sodium", "Milk of Magnesia", "Clobetasol Propionate 0.05% Cream", "Simvastatin", "Glucagon", "Influenza Virus Vaccine", "Dextrose 50%", "GlyBURIDE", "Mupirocin Nasal Ointment 2%", "Pneumococcal Vac Polyvalent", "Heparin Flush (10 units/ml)", "TraMADOL (Ultram)", "Metoprolol Tartrate", "Furosemide", "Ondansetron", "Lisinopril", "Potassium Chloride", "Acetaminophen", "Insulin", "Nitroglycerin", "PHENYLEPHrine", "Calcium Gluconate", "Magnesium Sulfate", "Insulin Human Regular", "Vancomycin", "CefazoLIN", "Ketorolac", "Acetaminophen IV", "5% Dextrose", "Syringe", "Sterile Water", "0.9% Sodium Chloride", "Bag", "HYDROmorphone (Dilaudid)", "Iso-Osmotic Dextrose", "Sodium Chloride 0.9%  Flush", "Bisacodyl", "Diazepam", "Zolpidem Tartrate", "Nitroglycerin SL", "Atenolol", "HydrALAzine", "Chlorhexidine Gluconate 0.12% Oral Rinse", "Propofol", "Glycopyrrolate", "Neostigmine", "Meperidine", "Aspirin", "Lactated Ringers", "Docusate Sodium (Liquid)", "Morphine Sulfate", "Metoclopramide", "Oxycodone-Acetaminophen"], "def": ["Aspirin EC, an enteric-coated formulation of aspirin, is commonly used for cardiovascular prevention but may be less effective in inhibiting platelet function and providing protection from cardiovascular events, especially in individuals with high body weight, while also causing mucosal erosions in the small intestine.", "Ranitidine is a non-imidazole blocker of histamine receptors used to treat gastrointestinal ulcers and decrease stomach acid production, and recent studies have found no increased risk of cancer associated with its use compared to other H2 receptor antagonists.", "Docusate Sodium is a commonly prescribed stool softener and laxative for the treatment of constipation, although its effectiveness remains unclear and it may not alleviate associated symptoms such as abdominal cramps.", "Milk of Magnesia, which contains magnesium hydroxide, is a common component of antacids and can be used as a replacement for magnesium oxide without affecting the performance or overall physiological response of mid lactating dairy Holstein cows.", "Clobetasol Propionate 0.05% Cream is a potent corticosteroid used topically to treat skin conditions such as psoriasis, eczema, contact dermatitis, and seborrheic dermatitis, but it may cause marked adrenocortical suppression and systemic side effects.", "Simvastatin is a statin medication used to lower lipid levels and reduce the risk of heart problems, and when combined with ezetimibe, it provides greater LDL cholesterol lowering effects and improves lipid and inflammatory profiles in hypercholesterolemic patients with metabolic syndrome.", "Glucagon is a peptide hormone produced by the pancreas that raises glucose and fatty acid levels in the bloodstream, playing a crucial role in metabolism and potentially offering therapeutic applications for the treatment of metabolic disorders.", "The Influenza Virus Vaccine, also known as flu shots, protects against infection by influenza viruses and new versions are developed twice a year to keep up with the rapidly changing virus, offering modest to high protection against influenza.", "Dextrose 50% is a commonly used intravenous sugar solution that is administered for nutritional supplementation or to regulate glucose levels in individuals with metabolic disorders.", "GlyBURIDE, also known as glibenclamide, is an antidiabetic medication used to treat type 2 diabetes, recommended to be taken with diet and exercise, and may be used with other antidiabetic medication.", "Mupirocin Nasal Ointment 2% is a topical antibiotic primarily effective against Gram-positive bacteria, commonly used to treat superficial skin infections such as impetigo or folliculitis, and may also be used to eliminate methicillin-resistant S. aureus (MRSA) in the nose without symptoms.", "The Pneumococcal Vac Polyvalent is an active immunization vaccine for intramuscular or subcutaneous injection against pneumococcal disease, including pneumonia and bacteremia, and is widely used in high-risk adults.", "Heparin Flush (10 units/ml) is a medication used as an anticoagulant in the treatment of heart attacks and unstable angina, and there is no significant difference in catheter longevity when compared to saline flush.", "Tramadol, sold under the brand name Ultram, is an opioid pain medication used to treat moderately severe pain, with an onset of pain relief within an hour when taken orally, and it can also act as a local anesthetic and antiarrhythmic when injected at higher concentrations.", "Metoprolol Tartrate is a widely prescribed beta-blocker medication used to treat high blood pressure, chest pain, fast heart rate, and prevent further heart problems, with different formulations available for immediate release, extended release, and controlled release.", "Furosemide is a loop diuretic commonly used to treat edema and chronic renal insufficiency, and it may also be used for the treatment of high blood pressure.", "Ondansetron is a medication used to prevent nausea and vomiting caused by cancer chemotherapy, radiation therapy, or surgery, and it can also be effective for treating gastroenteritis, with various administration options available including oral, intramuscular, and intravenous.", "Lisinopril is a potent inhibitor of angiotensin-converting enzyme (ACE) used to treat hypertension, heart failure, and prevent kidney problems in patients with diabetes mellitus, and it may also improve survival following a heart attack.", "Potassium chloride is a metal halide salt used in medicine that can be dissolved in water and has a salt-like taste, and it is important for maintaining cellular potassium levels and sodium transport.", "Acetaminophen, also known as paracetamol, is a widely used non-opioid analgesic and antipyretic medication, commonly used to treat fever and mild to moderate pain, but caution should be exercised to avoid overdose or repeated supratherapeutic ingestion as it can cause acute liver injury.", "Insulin is a short-acting peptide hormone produced by beta cells of the pancreas that promotes glucose metabolism, regulates the absorption of glucose into cells, inhibits hepatic glucose production, enhances protein synthesis, and is used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes.", "Nitroglycerin is a volatile vasodilator that relieves angina pectoris by stimulating guanylate cyclase, lowering cytosolic calcium, and is commonly used in the manufacture of explosives.", "Phenylephrine is a medication used for various purposes such as nasal decongestion, pupil dilation, increasing blood pressure, relieving hemorrhoids, and reducing bleeding associated with nasotracheal intubation or endoscopic sinus surgery.", "Calcium gluconate is a calcium salt used as a mineral supplement and medication, primarily administered through injection to treat low blood calcium, high blood potassium, and magnesium toxicity.", "Magnesium sulfate is a chemical compound commonly used for tocolysis in the management of preterm labor, and while it may cause alterations in mental status, it does not significantly affect maternal mental status during infusion.", "Insulin Human Regular, also known as Regular Insulin, is a short-acting form of insulin used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes, and it promotes glucose metabolism, inhibits hepatic glucose production, enhances protein synthesis, and inhibits lipolysis and proteolysis among other functions.", "Vancomycin is a glycopeptide antibiotic used to treat various bacterial infections, including complicated skin infections, bloodstream infections, endocarditis, bone and joint infections, and meningitis caused by methicillin-resistant Staphylococcus aureus, and therapeutic drug monitoring is recommended to optimize therapy and prevent nephrotoxicity.", "Cefazolin, a first-generation cephalosporin antibiotic, is commonly used to treat various bacterial infections, including cellulitis, urinary tract infections, pneumonia, endocarditis, joint infection, and biliary tract infections, and it can also be used to prevent group B streptococcal disease and for surgical prophylaxis.", "Ketorolac is a nonsteroidal anti-inflammatory drug (NSAID) commonly used for pain management in various conditions such as postoperative pain, rheumatoid arthritis, osteoarthritis, menstrual disorders, headaches, spinal and soft tissue pain, and ankylosing spondylitis, with potential side effects including sleepiness, dizziness, abdominal pain, swelling, and nausea.", "Acetaminophen IV is a commonly used analgesic and antipyretic medication that is available in various forms, including syrup, tablets, injection, and suppository, and research suggests that its analgesic properties are similar to oral and rectal administration.", "The prescription '5% Dextrose' is a glucose solution commonly used for nutritional supplementation or metabolic disorders where glucose levels are improperly regulated, and it is listed as an essential medicine by the World Health Organization.", "The prescription 'Syringe' refers to a non-essential amino acid involved in the biosynthesis of purines, pyrimidines, and other amino acids, as well as a reciprocating pump used for administering liquid or gas through a discharge orifice.", "Sterile water is a high-quality, contamination-free liquid used for making injection solutions, and it is commonly used in the treatment of patients with tympanostomy tubes and otorrhea.", "0.9% Sodium Chloride, also known as salt, is an essential medicine listed by the World Health Organization and is responsible for the salinity of seawater and extracellular fluid in organisms.", "Bagging treatment has been found to improve the appearance and quality of kiwifruit by increasing soluble solid content, carotenoid and anthocyanin levels, and decreasing chlorophyll levels, suggesting its potential benefits for health phenotyping.", "Hydromorphone (Dilaudid) is an opioid analgesic used to treat moderate to severe pain, including pain in obstetrics, and as an adjunct to anesthesia, but it has been requested to be removed from the market due to opioid misuse and abuse risks associated with its injectable reformulation.", "The use of Iso-Osmotic Dextrose (D5NS) in rats with closed head trauma (CHT) decreased brain edema without changing neurological severity score (NSS) or mortality rate (MR), suggesting its potential benefit in managing CHT-related complications.", "Sodium chloride 0.9% flush is a commonly used and safe solution for flushing and locking peripheral intravenous access devices, as it does not increase the risks of occlusion or other adverse events, and is as effective as heparin saline solution.", "Bisacodyl is a stimulant laxative used for the treatment of constipation and stimulation of bowel movement, and it works directly on the colon to produce a bowel movement.", "Diazepam is a benzodiazepine medication commonly used to treat severe anxiety disorders, insomnia, alcohol withdrawal syndrome, muscle spasms, seizures, and other conditions, and it may also be used to induce memory loss during medical procedures.", "Zolpidem Tartrate, also known as Ambien, is a hypnotic drug approved by the FDA in 1992 that improves sleep in patients with insomnia by decreasing sleep latency, increasing sleep duration, and reducing awakenings during sleep.", "Nitroglycerin SL is a volatile vasodilator used to relieve angina pectoris by stimulating guanylate cyclase and lowering cytosolic calcium, and its administration before radial artery puncture can improve cannulation success and decrease the incidence of radial artery spasm in transradial procedures.", "Atenolol is a beta blocker medication primarily used to treat high blood pressure and heart-associated chest pain, but it does not seem to improve mortality in those with high blood pressure, and it can also be used for the prevention of migraines and treatment of certain irregular heart beats.", "Hydralazine is a medication used to treat high blood pressure and heart failure, and it is a time-dependent inhibitor of the cytosolic drug metabolizing enzyme aldehyde oxidase (AO), with glutathione (GSH) suppressing its inhibition and playing a role in trapping a hydralazine reactive intermediate prior to enzyme inactivation.", "Chlorhexidine Gluconate 0.12% Oral Rinse is a disinfectant and topical anti-infective agent used as a mouthwash to prevent oral plaque and is beneficial for implant sites with peri implant mucositis, reducing the percentage of teeth with bleeding on probing.", "Propofol, also known as Diprivan, is a commonly used intravenous medication for anesthesia induction and maintenance, known for its rapid onset, short duration of action, and minimal side effects despite challenges associated with its oil emulsion formulation.", "Glycopyrrolate is a synthetic anticholinergic agent used as a treatment for chronic obstructive pulmonary disease (COPD) and in some disorders of the gastrointestinal tract, but it has notable adverse effects that should be considered when prescribing.", "Neostigmine is a cholinesterase inhibitor commonly used to treat myasthenia gravis, reverse the effects of muscle relaxants, and regulate the immune inflammatory response through the cholinergic anti-inflammatory pathway.", "Meperidine is a narcotic analgesic that is commonly used for the relief of moderate to severe pain, including postoperative pain and the pain of labor, but prolonged use may lead to dependence and withdrawal symptoms.", "Aspirin, also known as acetylsalicylic acid, is a nonsteroidal anti-inflammatory drug commonly used for pain relief, fever reduction, inflammation reduction, and as an antithrombotic, but it may cause more harm than benefit for primary prevention of atherosclerotic cardiovascular disease.", "Lactated Ringers, also known as Ringer's lactate solution, is a mixture of sodium chloride, sodium lactate, potassium chloride, and calcium chloride in water, used for fluid and electrolyte replacement in individuals with low blood volume or pressure, and it may also be used to treat metabolic acidosis and eye burns caused by chemicals.", "Docusate Sodium (Liquid) is a stool softener commonly used for the treatment of constipation, but its effectiveness in increasing stool frequency and softening remains unclear, and it does not alleviate associated symptoms such as abdominal cramps.", "Morphine sulfate is a potent analgesic derived from opium that is commonly used for chronic pain management, but its use is limited due to the risk of tolerance, withdrawal symptoms, and abuse, and it is also the precursor to other opioids.", "Metoclopramide is a dopamine D2 antagonist commonly used as an antiemetic and for the treatment of stomach and esophageal problems, including nausea, vomiting, delayed stomach emptying, and gastroesophageal reflux disease, with potential side effects such as fatigue, diarrhea, and restlessness.", "Oxycodone-Acetaminophen is a combination medication used to treat moderate to severe pain, but it has been implicated in deaths due to acetaminophen overdose and associated liver damage."]}, "procedure": {"idxs": ["3613", "3615", "3961"], "name": ["Aortocor bypas-3 cor art", "1 int mam-cor art bypass", "Extracorporeal circulat"], "def": ["The procedure_id 'Aortocor bypas-3 cor art' refers to a health procedure related to the bypass of three coronary arteries in the aorta, which is relevant for health phenotyping tasks.", "The procedure_id '1 int mam-cor art bypass' refers to a health procedure known as internal mammary-coronary artery bypass, which is used to treat a specific disease.", "The procedure_id 'Extracorporeal circulat' refers to a health condition related to the circulation of blood outside the body, which could be valuable for health phenotyping tasks."]}, "label": ["0", "0", "0", "1", "0", "0", "0", "0", "0", "1", "1", "1", "0", "1", "0", "0", "1", "0", "0", "0", "0", "0", "0", "0", "0"]}
{"disease": {"idxs": ["424", "997", "250", "401", "272", "427", "300"], "name": ["Other diseases of endocardium", "Complications affecting specified body system not elsewhere classified", "Diabetes mellitus", "Essential hypertension", "Disorders of lipoid metabolism", "Cardiac dysrhythmias", "Neurotic disorders"], "def": ["Endocarditis is an inflammation of the inner lining of the heart caused by microorganisms, leading to potential damage to heart valves and life-threatening complications, with symptoms including fever, shortness of breath, weakness, swelling, changes in heart rhythm, cough, and skin rashes.", "Complications affecting specified body systems not elsewhere classified can arise from various diseases, including diabetes mellitus, surgical procedures, and diseases of the digestive system, leading to pathological processes in multiple organs and tissues such as the eye, kidney, blood vessels, and nerve tissue.", "Diabetes mellitus is a group of metabolic disorders characterized by high blood sugar levels, insulin deficiency or unresponsiveness, and various complications such as cardiovascular disease, kidney disease, and infections.", "Essential hypertension, also known as primary hypertension, is the most common type of high blood pressure that develops gradually over time without a known cause, affecting 85% of those with high blood pressure, and is associated with increased risk of cardiovascular disease.", "Disorders of lipoid metabolism involve abnormal anabolism or catabolism of lipids in the body, including fatty acid oxidation disorders and X linked adrenoleukodystrophy, which is characterized by the accumulation of very long chain fatty acids and affects cholesterol metabolism.", "Cardiac dysrhythmias, also known as arrhythmias, are irregularities in the heartbeat that can manifest as a fast or slow heart rate, and may cause symptoms such as chest pain, shortness of breath, and dizziness.", "Neurotic disorders are distressing mental disorders recognized by the individual as unacceptable, affecting social relationships within acceptable limits, and are often caused by past anxiety or anxiety-related conditions."]}, "prescription": {"idxs": ["197", "123", "9", "16", "157", "3", "1", "2", "14", "67", "192", "4", "15", "77", "791", "507", "88", "211", "182", "287", "125", "8", "57", "98", "21", "120", "82", "164", "128", "116", "26", "17", "36", "12", "124", "7", "22", "28", "24", "85", "27", "23", "191", "190", "29", "309", "39", "115", "127", "117", "118", "18", "114", "25"], "name": ["Glipizide", "Ibuprofen", "Insulin", "Potassium Chloride", "traZODONE HCl", "D5W", "Warfarin", "Heparin Sodium", "Lorazepam", "Hydromorphone", "Olanzapine", "Furosemide", "Magnesium Sulfate", "Metoprolol", "Quinapril", "Mirtazapine", "Haloperidol", "Albuterol 0.083% Neb Soln", "Rosuvastatin Calcium", "Diltiazem", "Sodium Chloride 0.9%  Flush", "Docusate Sodium", "Ranitidine", "Aspirin EC", "Acetaminophen", "Milk of Magnesia", "Bisacodyl", "Cefazolin", "Syringe", "Phenylephrine HCl", "Nitroprusside Sodium", "Ketorolac", "NS", "Midazolam HCl", "LR", "Nitroglycerin", "Oxycodone-Acetaminophen", "Calcium Gluconate", "Morphine Sulfate", "Humulin-R Insulin", "SW", "Metoclopramide", "Iso-Osmotic Sodium Chloride", "Famotidine", "Dolasetron Mesylate", "Simethicone", "Soln.", "Glycopyrrolate", "Propofol", "Docusate Sodium (Liquid)", "Aspirin", "Sucralfate", "Neostigmine", "Meperidine"], "def": ["Glipizide is an oral hypoglycemic agent used to treat type 2 diabetes by stimulating the pancreas to release insulin and increasing tissue sensitivity to insulin, and it is commonly associated with side effects such as nausea, diarrhea, low blood sugar, and headache.", "Ibuprofen is a nonsteroidal anti-inflammatory drug commonly used for pain relief, fever reduction, and inflammation, but it can have serious adverse effects on various organs when used for a long duration or overdosed.", "Insulin is a short-acting peptide hormone produced by beta cells of the pancreas that promotes glucose metabolism, regulates the absorption of glucose into cells, inhibits hepatic glucose production, enhances protein synthesis, and is used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes.", "Potassium chloride is a metal halide salt used in medicine that can be dissolved in water and has a salt-like taste, and it is important for maintaining cellular potassium levels and sodium transport.", "Trazodone HCl is an antidepressant medication commonly used to treat major depressive disorder, anxiety disorders, and sleep difficulties, with common side effects including dry mouth, faintness, vomiting, and headache.", "D5W, a form of dextrose 5% in water, is commonly used intravenously to replace lost fluids, provide carbohydrates, and treat low blood sugar or water loss without electrolyte loss in various medical conditions.", "Warfarin is an anticoagulant that inhibits coagulation by preventing carboxylation of vitamin K-dependent clotting factors, and it has been associated with accelerated calcification of aortic valve interstitial cells in patients with aortic stenosis.", "Heparin Sodium is a heterogenous preparation of anionic, sulfated glycosaminoglycan polymers that acts as an anticoagulant by binding to antithrombin III and inactivating coagulation enzymes, but it requires continuous infusions and monitoring of activated partial prothrombin time, and has a higher risk of bleeding and osteoporosis in long-term use.", "Lorazepam is a benzodiazepine medication with anticonvulsant, anxiolytic, sedative, muscle relaxant, and amnesic properties, commonly used to treat severe anxiety disorders, insomnia, alcohol withdrawal syndrome, and chemotherapy-induced nausea and vomiting.", "Hydromorphone is a pure opioid derived from morphine, commonly used to treat moderate to severe pain, particularly in cancer patients, and has a high potency and comparable side effect profile to morphine.", "Olanzapine is an atypical antipsychotic primarily used to treat schizophrenia and bipolar disorder, and it has a lower incidence rate of adverse reactions compared to other classic antipsychotic medications, but overdose can lead to severe consequences such as rhabdomyolysis.", "Furosemide is a loop diuretic commonly used to treat edema and chronic renal insufficiency, and it may also be used for the treatment of high blood pressure.", "Magnesium sulfate is a chemical compound commonly used for tocolysis in the management of preterm labor, and while it may cause alterations in mental status, it does not significantly affect maternal mental status during infusion.", "Metoprolol is a widely prescribed selective beta-1 blocker medication used to treat high blood pressure, chest pain, fast heart rate, and prevent further heart problems after a heart attack, with different formulations available for immediate or extended release.", "Quinapril is a prodrug that belongs to the angiotensin-converting enzyme (ACE) inhibitor class of medications and is commonly used to treat essential hypertension, congestive heart failure, and diabetic kidney disease, with common side effects including headaches, dizziness, fatigue, and cough.", "Mirtazapine is an antidepressant commonly used to treat moderate to severe depression, and it may also be effective in cases of depression complicated by anxiety or insomnia, but it can cause side effects such as sleepiness, dizziness, increased appetite, and weight gain.", "Haloperidol is a traditional antipsychotic medication primarily used to treat schizophrenia and other psychoses, as well as schizoaffective disorder, delusional disorders, ballism, Tourette syndrome, and intractable hiccups, with potential adverse effects such as extrapyramidal symptoms and cognitive impairments.", "The study compared the efficacy and patient acceptability of bambuterol and controlled release salbutamol in treating nocturnal asthma, showing that both treatments were equally effective and well-tolerated, with some patients preferring bambuterol due to its better adverse effect profile and once-daily regimen.", "Rosuvastatin Calcium is a statin medication used to reduce plasma cholesterol levels, prevent cardiovascular disease, and has been shown to increase 25 hydroxyvitamin D levels.", "Diltiazem is a benzothiazepine derivative that acts as a calcium channel blocker and is used to treat high blood pressure, angina, certain heart arrhythmias, and hyperthyroidism when beta blockers cannot be used.", "Sodium chloride 0.9% flush is a commonly used and safe solution for flushing and locking peripheral intravenous access devices, as it does not increase the risks of occlusion or other adverse events, and is as effective as heparin saline solution.", "Docusate Sodium is a commonly prescribed stool softener and laxative for the treatment of constipation, although its effectiveness remains unclear and it may not alleviate associated symptoms such as abdominal cramps.", "Ranitidine is a non-imidazole blocker of histamine receptors used to treat gastrointestinal ulcers and decrease stomach acid production, and recent studies have found no increased risk of cancer associated with its use compared to other H2 receptor antagonists.", "Aspirin EC, an enteric-coated formulation of aspirin, is commonly used for cardiovascular prevention but may be less effective in inhibiting platelet function and providing protection from cardiovascular events, especially in individuals with high body weight, while also causing mucosal erosions in the small intestine.", "Acetaminophen, also known as paracetamol, is a widely used non-opioid analgesic and antipyretic medication, commonly used to treat fever and mild to moderate pain, but caution should be exercised to avoid overdose or repeated supratherapeutic ingestion as it can cause acute liver injury.", "Milk of Magnesia, which contains magnesium hydroxide, is a common component of antacids and can be used as a replacement for magnesium oxide without affecting the performance or overall physiological response of mid lactating dairy Holstein cows.", "Bisacodyl is a stimulant laxative used for the treatment of constipation and stimulation of bowel movement, and it works directly on the colon to produce a bowel movement.", "Cefazolin is a first-generation cephalosporin antibiotic used to treat various bacterial infections, including cellulitis, urinary tract infections, pneumonia, endocarditis, joint infection, and biliary tract infections, and it can also be used to prevent group B streptococcal disease before surgery or around the time of delivery.", "The prescription 'Syringe' refers to a non-essential amino acid involved in the biosynthesis of purines, pyrimidines, and other amino acids, as well as a reciprocating pump used for administering liquid or gas through a discharge orifice.", "Phenylephrine HCl is a sympathomimetic amine primarily used to treat nasal congestion, but it can also be effective in treating hypotension, shock, hypotension during spinal anesthesia, paroxysmal supraventricular tachycardia, hemorrhoids, and as an aid in diagnosing heart murmurs.", "Nitroprusside Sodium is a medication used to lower blood pressure in patients experiencing a hypertensive emergency, certain types of heart failure, and during surgery to decrease bleeding, and it can be substituted with alternative drugs like clevidipine or nicardipine to address the issue of hyperinflation.", "Ketorolac is a nonsteroidal anti-inflammatory drug (NSAID) commonly used for pain management in various conditions such as postoperative pain, rheumatoid arthritis, osteoarthritis, menstrual disorders, headaches, spinal and soft tissue pain, and ankylosing spondylitis, with potential side effects including sleepiness, dizziness, abdominal pain, swelling, and nausea.", "Chloroxylenol (NS) is an antiseptic and disinfectant agent commonly used for skin disinfection, cleaning surgical instruments, and wound-cleansing applications. It is effective against Gram positive bacteria and is listed as an essential medicine by the World Health Organization.", "Midazolam HCl is a short-acting benzodiazepine medication with multiple properties, including hypnotic-sedative, anxiolytic, muscle relaxant, anticonvulsant, sedative, hypnotic, and amnesic effects, commonly used for anesthesia, procedural sedation, and treating severe agitation.", "LR is a disease that involves long latency reflexes (LLRs) which are late responses in nerve conduction studies, providing a measure of proximal nerve and central conduction, and can be used for evaluating central nervous system or proximal peripheral nerve disorders.", "Nitroglycerin is a volatile vasodilator that relieves angina pectoris by stimulating guanylate cyclase, lowering cytosolic calcium, and is commonly used in the manufacture of explosives.", "Oxycodone-Acetaminophen is a combination medication used to treat moderate to severe pain, but it has been implicated in deaths due to acetaminophen overdose and associated liver damage.", "Calcium gluconate is a calcium salt used as a mineral supplement and medication, primarily administered through injection to treat low blood calcium, high blood potassium, and magnesium toxicity.", "Morphine sulfate is a potent analgesic derived from opium that is commonly used for chronic pain management, but its use is limited due to the risk of tolerance, withdrawal symptoms, and abuse, and it is also the precursor to other opioids.", "Humulin-R Insulin is a short-acting form of insulin used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes, and it promotes glucose metabolism, inhibits hepatic glucose production, enhances protein synthesis, and inhibits lipolysis and proteolysis among other functions.", "", "Metoclopramide is a dopamine D2 antagonist commonly used as an antiemetic and for the treatment of stomach and esophageal problems, including nausea, vomiting, delayed stomach emptying, and gastroesophageal reflux disease, with potential side effects such as fatigue, diarrhea, and restlessness.", "Iso-Osmotic Sodium Chloride, also known as salt, is an ionic compound that is responsible for the salinity of seawater and extracellular fluid, and its effects on growth and metabolism have been studied in ornamental shrubs.", "Famotidine is a histamine H2 receptor antagonist medication that inhibits gastric secretion and is used to treat peptic ulcer disease, gastroesophageal reflux disease, and Zollinger-Ellison syndrome, with potential side effects including headache, intestinal upset, and dizziness.", "Dolasetron Mesylate is a highly specific and selective serotonin 5-HT3 receptor antagonist used as an antinauseant and antiemetic agent for the prevention of nausea and vomiting associated with cancer chemotherapy and postoperative procedures.", "Simethicone, also known as simeticone, is a silicone oil used as an anti-foaming agent to reduce bloating, discomfort, or pain caused by excessive gas in the gastrointestinal tract, and it has also been observed to have moisturizing actions on the skin.", "The prescription 'Soln.' may refer to Solnechnogorsk, a town in Russia, or Solanum nigrum, an edible medicinal herb with various therapeutic potential including antitumor, anti-inflammatory, antioxidant, antibacterial, and neuroprotective activities.", "Glycopyrrolate is a synthetic anticholinergic agent used as a treatment for chronic obstructive pulmonary disease (COPD) and in some disorders of the gastrointestinal tract, but it has notable adverse effects that should be considered when prescribing.", "Propofol, also known as Diprivan, is a commonly used intravenous medication for anesthesia induction and maintenance, known for its rapid onset, short duration of action, and minimal side effects despite challenges associated with its oil emulsion formulation.", "Docusate Sodium (Liquid) is a stool softener commonly used for the treatment of constipation, but its effectiveness in increasing stool frequency and softening remains unclear, and it does not alleviate associated symptoms such as abdominal cramps.", "Aspirin, also known as acetylsalicylic acid, is a nonsteroidal anti-inflammatory drug commonly used for pain relief, fever reduction, inflammation reduction, and as an antithrombotic, but it may cause more harm than benefit for primary prevention of atherosclerotic cardiovascular disease.", "Sucralfate is a medication used to treat stomach ulcers, gastroesophageal reflux disease, radiation proctitis, and stomach inflammation, and it can also prevent stress ulcers.", "Neostigmine is a cholinesterase inhibitor commonly used to treat myasthenia gravis, reverse the effects of muscle relaxants, and regulate the immune inflammatory response through the cholinergic anti-inflammatory pathway.", "Meperidine is a narcotic analgesic that is commonly used for the relief of moderate to severe pain, including postoperative pain and the pain of labor, but prolonged use may lead to dependence and withdrawal symptoms."]}, "procedure": {"idxs": ["3522", "3961", "9904"], "name": ["Opn/oth rep aortic valve", "Extracorporeal circulat", "Packed cell transfusion"], "def": ["The procedure_id 'Opn/oth rep aortic valve' refers to the surgical replacement or repair of the aortic valve, which is relevant information for health phenotyping tasks related to this specific procedure.", "The procedure_id 'Extracorporeal circulat' refers to a health condition related to the circulation of blood outside the body, which could be valuable for health phenotyping tasks.", "The procedure_id 'Packed cell transfusion' refers to a medical procedure involving the transfusion of packed red blood cells, commonly used in the treatment of various diseases."]}, "label": ["0", "0", "0", "1", "0", "0", "1", "0", "0", "0", "1", "1", "1", "1", "0", "0", "1", "0", "1", "1", "0", "0", "0", "0", "0"]}
{"disease": {"idxs": ["153", "578", "280", "424", "287", "261", "501"], "name": ["Malignant neoplasm of colon", "Gastrointestinal hemorrhage", "Iron deficiency anemias", "Other diseases of endocardium", "Purpura and other hemorrhagic conditions", "Nutritional marasmus", "Asbestosis"], "def": ["Malignant neoplasm of the colon, also known as colon cancer, is a type of abnormal and excessive growth of tissue in the colon that can quickly become malignant, and it is associated with Lynch syndrome, which is the most common form of inherited colon cancer and can also affect other organs.", "Gastrointestinal hemorrhage, also known as gastrointestinal bleeding, is a condition characterized by bleeding in any part of the gastrointestinal tract, which can lead to symptoms such as vomiting blood, black stool, anemia, and even life-threatening complications.", "Iron deficiency anemias is a condition characterized by low iron stores, decreased hemoglobin concentration, and microcytic hypochromic erythrocytes, and it is the most common cause of anemia worldwide.", "Endocarditis is an inflammation of the inner lining of the heart caused by microorganisms, leading to potential damage to heart valves and life-threatening complications, with symptoms including fever, shortness of breath, weakness, swelling, changes in heart rhythm, cough, and skin rashes.", "Purpura and other hemorrhagic conditions, such as thrombotic thrombocytopenic purpura (TTP), are acquired or congenital disorders characterized by platelet aggregation, thrombosis, thrombocytopenia, hemolytic anemia, and potential end-organ damage, with mutations in the ADAMTS13 protein gene identified in familial cases.", "Nutritional marasmus is a severe form of malnutrition characterized by insufficient intake of nutrients, resulting in weight loss and potential complications such as anemia and low levels of vitamin D.", "Asbestosis is a form of pneumoconiosis caused by inhalation of asbestos fibers, leading to interstitial fibrosis of the lung, and the risk of lung damage is related to the amount and duration of exposure to asbestos."]}, "prescription": {"idxs": ["125", "36", "726", "124", "15", "16", "38", "80", "66", "110"], "name": ["Sodium Chloride 0.9%  Flush", "NS", "Golytely", "LR", "Magnesium Sulfate", "Potassium Chloride", "Pantoprazole Sodium", "Vial", "D5 1/2NS", "Pneumococcal Vac Polyvalent"], "def": ["Sodium chloride 0.9% flush is a commonly used and safe solution for flushing and locking peripheral intravenous access devices, as it does not increase the risks of occlusion or other adverse events, and is as effective as heparin saline solution.", "Chloroxylenol (NS) is an antiseptic and disinfectant agent commonly used for skin disinfection, cleaning surgical instruments, and wound-cleansing applications. It is effective against Gram positive bacteria and is listed as an essential medicine by the World Health Organization.", "Golytely is a medication commonly used as a pH buffering agent, electrolyte replenisher, and systemic alkalizer, and it contains sodium bicarbonate and macrogol, which is used to treat constipation and empty the bowels before a colonoscopy.", "LR is a disease that involves long latency reflexes (LLRs) which are late responses in nerve conduction studies, providing a measure of proximal nerve and central conduction, and can be used for evaluating central nervous system or proximal peripheral nerve disorders.", "Magnesium sulfate is a chemical compound commonly used for tocolysis in the management of preterm labor, and while it may cause alterations in mental status, it does not significantly affect maternal mental status during infusion.", "Potassium chloride is a metal halide salt used in medicine that can be dissolved in water and has a salt-like taste, and it is important for maintaining cellular potassium levels and sodium transport.", "Pantoprazole Sodium is a first-generation proton pump inhibitor (PPI) that is commonly used for the initial treatment and maintenance therapy of gastroesophageal reflux disease (GERD), as well as for managing other disorders requiring a decrease in gastric acid secretion.", "Vials are small glass or plastic containers used to store medication, and they can be single dose or multi-dose, with specific guidelines set by the CDC for the latter.", "The prescription 'D5 1/2NS' is a solution used to treat low blood sugar or water loss without electrolyte loss, and it may decrease brain edema without altering neurological severity score or mortality rate after closed head trauma in rats.", "The Pneumococcal Vac Polyvalent is an active immunization vaccine for intramuscular or subcutaneous injection against pneumococcal disease, including pneumonia and bacteremia, and is widely used in high-risk adults."]}, "procedure": {"idxs": ["4542", "9904"], "name": ["Endo polpectomy lrge int", "Packed cell transfusion"], "def": ["The procedure 'Endo polpectomy lrge int' is related to the removal of large intestinal polyps.", "The procedure_id 'Packed cell transfusion' refers to a medical procedure involving the transfusion of packed red blood cells, commonly used in the treatment of various diseases."]}, "label": ["0", "0", "0", "1", "0", "0", "1", "0", "0", "1", "0", "0", "0", "0", "0", "0", "0", "0", "1", "0", "1", "0", "1", "0", "0"]}
{"disease": {"idxs": ["153", "424", "997", "518", "427", "280", "414", "458"], "name": ["Malignant neoplasm of colon", "Other diseases of endocardium", "Complications affecting specified body system not elsewhere classified", "Other diseases of lung", "Cardiac dysrhythmias", "Iron deficiency anemias", "Other forms of chronic ischemic heart disease", "Hypotension"], "def": ["Malignant neoplasm of the colon, also known as colon cancer, is a type of abnormal and excessive growth of tissue in the colon that can quickly become malignant, and it is associated with Lynch syndrome, which is the most common form of inherited colon cancer and can also affect other organs.", "Endocarditis is an inflammation of the inner lining of the heart caused by microorganisms, leading to potential damage to heart valves and life-threatening complications, with symptoms including fever, shortness of breath, weakness, swelling, changes in heart rhythm, cough, and skin rashes.", "Complications affecting specified body systems not elsewhere classified can arise from various diseases, including diabetes mellitus, surgical procedures, and diseases of the digestive system, leading to pathological processes in multiple organs and tissues such as the eye, kidney, blood vessels, and nerve tissue.", "Other diseases of the lung include fungal infections, lung damage from various conditions, interstitial lung disease, and the significant impact of pulmonary diseases on mortality and disability worldwide, highlighting the potential of nanotechnology in improving treatment and diagnostics for these disorders.", "Cardiac dysrhythmias, also known as arrhythmias, are irregularities in the heartbeat that can manifest as a fast or slow heart rate, and may cause symptoms such as chest pain, shortness of breath, and dizziness.", "Iron deficiency anemias is a condition characterized by low iron stores, decreased hemoglobin concentration, and microcytic hypochromic erythrocytes, and it is the most common cause of anemia worldwide.", "Chronic ischemic heart disease is associated with peripheral artery disease, heart failure, and the potential for early stage detection of chronic kidney diseases, which may be treated through the regulation of NAD biosynthesis and the use of nanoparticles for targeted delivery of non coding RNAs or NAD metabolites.", "Hypotension, specifically orthostatic hypotension, is characterized by a significant drop in blood pressure upon standing and can lead to symptoms such as dizziness, blurred vision, and syncope, while also being a risk factor for cardiovascular diseases and complications."]}, "prescription": {"idxs": ["72", "8", "10", "65", "68", "125", "98", "66", "20", "36", "124", "19", "77", "67", "29", "21", "153", "83", "154", "15", "145", "55", "28", "80", "38", "105", "9", "285", "56"], "name": ["Heparin Flush CVL  (100 units/ml)", "Docusate Sodium", "Atropine Sulfate", "1/2 NS", "Pantoprazole", "Sodium Chloride 0.9%  Flush", "Aspirin EC", "D5 1/2NS", "Iso-Osmotic Dextrose", "NS", "LR", "Vancomycin HCl", "Metoprolol", "Hydromorphone", "Dolasetron Mesylate", "Acetaminophen", "Gentamicin", "Metronidazole", "Isotonic Sodium Chloride", "Magnesium Sulfate", "Potassium Chl 20 mEq / 1000 mL D5 1/2 NS", "Heparin", "Calcium Gluconate", "Vial", "Pantoprazole Sodium", "Amiodarone HCl", "Insulin", "Ferrous Sulfate", "Senna"], "def": ["The study compared heparin flush solution with 0.9% sodium chloride flush solution for central venous catheter lumen patency and found that both solutions have similar rates of lumen nonpatency, suggesting that 0.9% sodium chloride may be preferred for short-term use central venous catheter maintenance due to potential safety concerns with heparin.", "Docusate Sodium is a commonly prescribed stool softener and laxative for the treatment of constipation, although its effectiveness remains unclear and it may not alleviate associated symptoms such as abdominal cramps.", "Atropine Sulfate is an alkaloid medication derived from Atropa belladonna and other plants, primarily solanaceae, used to treat nerve agent and pesticide poisonings, slow heart rate, decrease saliva production during surgery, uveitis, and early amblyopia, but it can also cause toxicity with symptoms such as hyperexcitability, paralysis, shallow respiration, vomiting, aspiration of seawater, and pulmonary edema.", "The prescription '1/2 NS' refers to a low cost and high yield method of obtaining ZnOHF ZnO based 2D nanostars (NSs) through chemical bath deposition, which can be used as active materials for water splitting and green hydrogen production.", "Pantoprazole is a first-generation proton pump inhibitor that is commonly used for the treatment of gastroesophageal reflux disease (GERD) and other disorders requiring a decrease in gastric acid secretion, and it is available in various forms including oral capsules, oral suspension, and intravenous injection.", "Sodium chloride 0.9% flush is a commonly used and safe solution for flushing and locking peripheral intravenous access devices, as it does not increase the risks of occlusion or other adverse events, and is as effective as heparin saline solution.", "Aspirin EC, an enteric-coated formulation of aspirin, is commonly used for cardiovascular prevention but may be less effective in inhibiting platelet function and providing protection from cardiovascular events, especially in individuals with high body weight, while also causing mucosal erosions in the small intestine.", "The prescription 'D5 1/2NS' is a solution used to treat low blood sugar or water loss without electrolyte loss, and it may decrease brain edema without altering neurological severity score or mortality rate after closed head trauma in rats.", "The use of Iso-Osmotic Dextrose (D5NS) in rats with closed head trauma (CHT) decreased brain edema without changing neurological severity score (NSS) or mortality rate (MR), suggesting its potential benefit in managing CHT-related complications.", "Chloroxylenol (NS) is an antiseptic and disinfectant agent commonly used for skin disinfection, cleaning surgical instruments, and wound-cleansing applications. It is effective against Gram positive bacteria and is listed as an essential medicine by the World Health Organization.", "LR is a disease that involves long latency reflexes (LLRs) which are late responses in nerve conduction studies, providing a measure of proximal nerve and central conduction, and can be used for evaluating central nervous system or proximal peripheral nerve disorders.", "Vancomycin HCl is a glycopeptide antibiotic used to treat various bacterial infections, including complicated skin infections, bloodstream infections, endocarditis, bone and joint infections, and meningitis caused by methicillin-resistant Staphylococcus aureus, and its stability remains within the acceptable range when stored at room temperature or under refrigeration for up to 30 days.", "Metoprolol is a widely prescribed selective beta-1 blocker medication used to treat high blood pressure, chest pain, fast heart rate, and prevent further heart problems after a heart attack, with different formulations available for immediate or extended release.", "Hydromorphone is a pure opioid derived from morphine, commonly used to treat moderate to severe pain, particularly in cancer patients, and has a high potency and comparable side effect profile to morphine.", "Dolasetron Mesylate is a highly specific and selective serotonin 5-HT3 receptor antagonist used as an antinauseant and antiemetic agent for the prevention of nausea and vomiting associated with cancer chemotherapy and postoperative procedures.", "Acetaminophen, also known as paracetamol, is a widely used non-opioid analgesic and antipyretic medication, commonly used to treat fever and mild to moderate pain, but caution should be exercised to avoid overdose or repeated supratherapeutic ingestion as it can cause acute liver injury.", "Gentamicin is a broad-spectrum antibiotic used to treat various bacterial infections, but it may cause ear and kidney damage, and its dosage needs to be carefully adjusted in critically ill neonates.", "Metronidazole is a nitroimidazole antibiotic and antiprotozoal medication used to treat various infections, including amebiasis, vaginitis, trichomonas infections, giardiasis, anaerobic bacterial infections, and treponemal infections, and it has been proposed as a radiation sensitizer for hypoxic cells, but it may also be a carcinogen.", "Isotonic Sodium Chloride, also known as saline solution, is a mixture of sodium chloride and water commonly used in medicine for various purposes including wound cleaning, contact lens storage, and treatment of dehydration.", "Magnesium sulfate is a chemical compound commonly used for tocolysis in the management of preterm labor, and while it may cause alterations in mental status, it does not significantly affect maternal mental status during infusion.", "The prescription 'Potassium Chl 20 mEq / 1000 mL D5 1/2 NS' can potentially cause severe hyperkalemia, especially in elderly hospitalized patients, and should be monitored closely for adverse effects.", "Heparin is a low molecular weight anticoagulant derived from porcine intestinal mucosa, used for the prevention of postoperative venous thrombosis and also in the treatment of heart attacks and unstable angina.", "Calcium gluconate is a calcium salt used as a mineral supplement and medication, primarily administered through injection to treat low blood calcium, high blood potassium, and magnesium toxicity.", "Vials are small glass or plastic containers used to store medication, and they can be single dose or multi-dose, with specific guidelines set by the CDC for the latter.", "Pantoprazole Sodium is a first-generation proton pump inhibitor (PPI) that is commonly used for the initial treatment and maintenance therapy of gastroesophageal reflux disease (GERD), as well as for managing other disorders requiring a decrease in gastric acid secretion.", "Amiodarone HCl is an antianginal and antiarrhythmic drug that increases the duration of ventricular and atrial muscle action, resulting in a decrease in heart rate and vascular resistance. It is used to treat and prevent various types of cardiac dysrhythmias, but evidence in cardiac arrest is poor. The drug is available in tablet form and is stable in an oral suspension for 3 months under refrigeration and for 6 weeks at room temperature. However, it cannot be used in young pediatric patients.", "Insulin is a short-acting peptide hormone produced by beta cells of the pancreas that promotes glucose metabolism, regulates the absorption of glucose into cells, inhibits hepatic glucose production, enhances protein synthesis, and is used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes.", "Ferrous sulfate, also known as Green vitriol, is a synthetic iron supplement used to treat or prevent low blood levels of iron, such as anemia or during pregnancy.", "Senna is a medication used to treat constipation and empty the large intestine before surgery, and it has been found to inhibit the ribonuclease H activity of HIV reverse transcriptase."]}, "procedure": {"idxs": ["4573", "3596", "3723", "8856", "9961"], "name": ["Opn rt hemicolectomy NEC", "Perc balloon valvuplasty", "Rt/left heart card cath", "Coronar arteriogr-2 cath", "Atrial cardioversion"], "def": ["The procedure 'Opn rt hemicolectomy NEC' refers to an open right hemicolectomy for an unspecified disease.", "The procedure_id 'Perc balloon valvuplasty' refers to a health procedure known as percutaneous balloon valvuloplasty, which is used to treat certain heart conditions.", "The procedure_id 'Rt/left heart card cath' refers to a diagnostic procedure involving the insertion of a catheter into the right or left side of the heart, commonly used for cardiovascular phenotyping.", "The procedure_id 'Coronar arteriogr-2 cath' refers to a health procedure related to coronary artery imaging using a catheter.", "The procedure_id 'Atrial cardioversion' refers to a medical procedure used for treating a condition called atrial fibrillation."]}, "label": ["0", "0", "0", "1", "0", "0", "1", "0", "1", "0", "0", "0", "0", "0", "1", "1", "0", "0", "1", "0", "1", "1", "1", "1", "1"]}
{"disease": {"idxs": ["424", "995", "512", "787", "530", "428", "518", "427", "998", "038", "785", "482", "707"], "name": ["Other diseases of endocardium", "Certain adverse effects not elsewhere classified", "Pneumothorax", "Symptoms involving digestive system", "Diseases of esophagus", "Heart failure", "Other diseases of lung", "Cardiac dysrhythmias", "Other complications of procedures not elsewhere classified", "Septicaemia", "Symptoms involving cardiovascular system", "Other bacterial pneumonia", "Chronic ulcer of skin"], "def": ["Endocarditis is an inflammation of the inner lining of the heart caused by microorganisms, leading to potential damage to heart valves and life-threatening complications, with symptoms including fever, shortness of breath, weakness, swelling, changes in heart rhythm, cough, and skin rashes.", "Certain adverse effects not elsewhere classified are disorders that result from the intended use of pharmaceutical preparations, including chemically-induced adverse conditions due to toxicity, drug interactions, and metabolic effects. Additionally, the FDA warns about rare serious reactions caused by nonprescription acne products, and the NIOSH provides a hazardous drug list to inform healthcare professionals about protection measures.", "Pneumothorax is the abnormal accumulation of air in the pleural cavity, causing lung collapse and symptoms such as sudden chest pain and shortness of breath, with tension pneumothorax being a severe form characterized by midline deviation and compression of both lungs.", "Patients with the disease_id 'Symptoms involving digestive system' may experience a variety of signs and symptoms affecting the digestive system, such as abdominal pain, diarrhea, and bleeding, which can be evaluated through abdominal imaging and endoscopy for diagnosis and management.", "\"Diseases of the esophagus encompass a range of pathological processes, including infectious esophagitis, Barrett's esophagus (a premalignant condition), and esophageal motor disorders, which can cause dysphagia and other symptoms.\"", "Heart failure is a heterogeneous condition characterized by the heart's inability to pump sufficient blood, resulting in symptoms such as shortness of breath, fatigue, swelling, and decreased exercise tolerance, and it can be caused by structural defects, functional abnormalities, or sudden overload.", "Other diseases of the lung include fungal infections, lung damage from various conditions, interstitial lung disease, and the significant impact of pulmonary diseases on mortality and disability worldwide, highlighting the potential of nanotechnology in improving treatment and diagnostics for these disorders.", "Cardiac dysrhythmias, also known as arrhythmias, are irregularities in the heartbeat that can manifest as a fast or slow heart rate, and may cause symptoms such as chest pain, shortness of breath, and dizziness.", "The Clavien Dindo classification is an important tool for assessing surgical complications and has been successfully validated in surgical centers worldwide, providing a systematic approach to categorizing complications based on their severity.", "Septicaemia, also known as septicemia or blood poisoning, is a systemic disease caused by the presence of pathogenic microorganisms or their toxins in the blood, leading to potentially life-threatening conditions such as septic shock and sepsis, which can result in low blood pressure, fever, rapid heart rate, lightheadedness, shortness of breath, and confusion.", "Symptoms involving the cardiovascular system can vary between men and women, with men more likely to experience chest pain and women more likely to experience other symptoms such as shortness of breath, nausea, and extreme fatigue.", "Other bacterial pneumonia is a type of pneumonia caused by bacterial infection, with Streptococcus pneumoniae being the most common bacterial cause in all age groups except newborn infants.", "Chronic ulcers of the skin are non-healing wounds that can develop into squamous cell carcinoma, and their poor healing is attributed to factors such as impaired perfusion, chronic inflammation, and tissue growth associated with specific vessel morphology."]}, "prescription": {"idxs": ["115", "124", "18", "57", "117", "114", "164", "36", "128", "3", "25", "127", "116", "7", "118", "233", "8", "24", "38", "80", "27", "98", "21", "22", "23", "15", "28", "125", "126", "16", "180", "106", "105", "4", "14", "20", "19", "1104", "70", "178", "83", "270", "113", "132", "1", "528", "221", "44", "84", "211", "55", "2", "217", "216", "94", "171"], "name": ["Glycopyrrolate", "LR", "Sucralfate", "Ranitidine", "Docusate Sodium (Liquid)", "Neostigmine", "Cefazolin", "NS", "Syringe", "D5W", "Meperidine", "Propofol", "Phenylephrine HCl", "Nitroglycerin", "Aspirin", "Epinephrine", "Docusate Sodium", "Morphine Sulfate", "Pantoprazole Sodium", "Vial", "SW", "Aspirin EC", "Acetaminophen", "Oxycodone-Acetaminophen", "Metoclopramide", "Magnesium Sulfate", "Calcium Gluconate", "Sodium Chloride 0.9%  Flush", "Insulin Human Regular", "Potassium Chloride", "Dextrose 50%", "D5W (EXCEL BAG)", "Amiodarone HCl", "Furosemide", "Lorazepam", "Iso-Osmotic Dextrose", "Vancomycin HCl", "Potassium Chl 40 mEq / 1000 mL D5W", "Nystatin Oral Suspension", "Digoxin", "Metronidazole", "Heparin Flush PICC (100 units/ml)", "Cosyntropin", "Lansoprazole Oral Suspension", "Warfarin", "Alteplase", "Tamsulosin HCl", "Levofloxacin", "Dextrose 5%", "Albuterol 0.083% Neb Soln", "Heparin", "Heparin Sodium", "Albuterol-Ipratropium", "Fluticasone Propionate 110mcg", "Ipratropium Bromide Neb", "Acetylcysteine 20%"], "def": ["Glycopyrrolate is a synthetic anticholinergic agent used as a treatment for chronic obstructive pulmonary disease (COPD) and in some disorders of the gastrointestinal tract, but it has notable adverse effects that should be considered when prescribing.", "LR is a disease that involves long latency reflexes (LLRs) which are late responses in nerve conduction studies, providing a measure of proximal nerve and central conduction, and can be used for evaluating central nervous system or proximal peripheral nerve disorders.", "Sucralfate is a medication used to treat stomach ulcers, gastroesophageal reflux disease, radiation proctitis, and stomach inflammation, and it can also prevent stress ulcers.", "Ranitidine is a non-imidazole blocker of histamine receptors used to treat gastrointestinal ulcers and decrease stomach acid production, and recent studies have found no increased risk of cancer associated with its use compared to other H2 receptor antagonists.", "Docusate Sodium (Liquid) is a stool softener commonly used for the treatment of constipation, but its effectiveness in increasing stool frequency and softening remains unclear, and it does not alleviate associated symptoms such as abdominal cramps.", "Neostigmine is a cholinesterase inhibitor commonly used to treat myasthenia gravis, reverse the effects of muscle relaxants, and regulate the immune inflammatory response through the cholinergic anti-inflammatory pathway.", "Cefazolin is a first-generation cephalosporin antibiotic used to treat various bacterial infections, including cellulitis, urinary tract infections, pneumonia, endocarditis, joint infection, and biliary tract infections, and it can also be used to prevent group B streptococcal disease before surgery or around the time of delivery.", "Chloroxylenol (NS) is an antiseptic and disinfectant agent commonly used for skin disinfection, cleaning surgical instruments, and wound-cleansing applications. It is effective against Gram positive bacteria and is listed as an essential medicine by the World Health Organization.", "The prescription 'Syringe' refers to a non-essential amino acid involved in the biosynthesis of purines, pyrimidines, and other amino acids, as well as a reciprocating pump used for administering liquid or gas through a discharge orifice.", "D5W, a form of dextrose 5% in water, is commonly used intravenously to replace lost fluids, provide carbohydrates, and treat low blood sugar or water loss without electrolyte loss in various medical conditions.", "Meperidine is a narcotic analgesic that is commonly used for the relief of moderate to severe pain, including postoperative pain and the pain of labor, but prolonged use may lead to dependence and withdrawal symptoms.", "Propofol, also known as Diprivan, is a commonly used intravenous medication for anesthesia induction and maintenance, known for its rapid onset, short duration of action, and minimal side effects despite challenges associated with its oil emulsion formulation.", "Phenylephrine HCl is a sympathomimetic amine primarily used to treat nasal congestion, but it can also be effective in treating hypotension, shock, hypotension during spinal anesthesia, paroxysmal supraventricular tachycardia, hemorrhoids, and as an aid in diagnosing heart murmurs.", "Nitroglycerin is a volatile vasodilator that relieves angina pectoris by stimulating guanylate cyclase, lowering cytosolic calcium, and is commonly used in the manufacture of explosives.", "Aspirin, also known as acetylsalicylic acid, is a nonsteroidal anti-inflammatory drug commonly used for pain relief, fever reduction, inflammation reduction, and as an antithrombotic, but it may cause more harm than benefit for primary prevention of atherosclerotic cardiovascular disease.", "Epinephrine, also known as adrenaline, is a hormone and medication produced by the adrenal glands that is used in the treatment of hypersensitivity reactions and anaphylaxis, with various dosage delivery routes available.", "Docusate Sodium is a commonly prescribed stool softener and laxative for the treatment of constipation, although its effectiveness remains unclear and it may not alleviate associated symptoms such as abdominal cramps.", "Morphine sulfate is a potent analgesic derived from opium that is commonly used for chronic pain management, but its use is limited due to the risk of tolerance, withdrawal symptoms, and abuse, and it is also the precursor to other opioids.", "Pantoprazole Sodium is a first-generation proton pump inhibitor (PPI) that is commonly used for the initial treatment and maintenance therapy of gastroesophageal reflux disease (GERD), as well as for managing other disorders requiring a decrease in gastric acid secretion.", "Vials are small glass or plastic containers used to store medication, and they can be single dose or multi-dose, with specific guidelines set by the CDC for the latter.", "", "Aspirin EC, an enteric-coated formulation of aspirin, is commonly used for cardiovascular prevention but may be less effective in inhibiting platelet function and providing protection from cardiovascular events, especially in individuals with high body weight, while also causing mucosal erosions in the small intestine.", "Acetaminophen, also known as paracetamol, is a widely used non-opioid analgesic and antipyretic medication, commonly used to treat fever and mild to moderate pain, but caution should be exercised to avoid overdose or repeated supratherapeutic ingestion as it can cause acute liver injury.", "Oxycodone-Acetaminophen is a combination medication used to treat moderate to severe pain, but it has been implicated in deaths due to acetaminophen overdose and associated liver damage.", "Metoclopramide is a dopamine D2 antagonist commonly used as an antiemetic and for the treatment of stomach and esophageal problems, including nausea, vomiting, delayed stomach emptying, and gastroesophageal reflux disease, with potential side effects such as fatigue, diarrhea, and restlessness.", "Magnesium sulfate is a chemical compound commonly used for tocolysis in the management of preterm labor, and while it may cause alterations in mental status, it does not significantly affect maternal mental status during infusion.", "Calcium gluconate is a calcium salt used as a mineral supplement and medication, primarily administered through injection to treat low blood calcium, high blood potassium, and magnesium toxicity.", "Sodium chloride 0.9% flush is a commonly used and safe solution for flushing and locking peripheral intravenous access devices, as it does not increase the risks of occlusion or other adverse events, and is as effective as heparin saline solution.", "Insulin Human Regular, also known as Regular Insulin, is a short-acting form of insulin used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes, and it promotes glucose metabolism, inhibits hepatic glucose production, enhances protein synthesis, and inhibits lipolysis and proteolysis among other functions.", "Potassium chloride is a metal halide salt used in medicine that can be dissolved in water and has a salt-like taste, and it is important for maintaining cellular potassium levels and sodium transport.", "Dextrose 50% is a commonly used intravenous sugar solution that is administered for nutritional supplementation or to regulate glucose levels in individuals with metabolic disorders.", "D5W (EXCEL BAG) is a prescription that is used to replace lost fluids and provide carbohydrates to the body through intravenous injection, and its consideration during radiofrequency ablation of hepatocellular carcinomas near the 'bare area of liver' can significantly influence the ablation outcome.", "Amiodarone HCl is an antianginal and antiarrhythmic drug that increases the duration of ventricular and atrial muscle action, resulting in a decrease in heart rate and vascular resistance. It is used to treat and prevent various types of cardiac dysrhythmias, but evidence in cardiac arrest is poor. The drug is available in tablet form and is stable in an oral suspension for 3 months under refrigeration and for 6 weeks at room temperature. However, it cannot be used in young pediatric patients.", "Furosemide is a loop diuretic commonly used to treat edema and chronic renal insufficiency, and it may also be used for the treatment of high blood pressure.", "Lorazepam is a benzodiazepine medication with anticonvulsant, anxiolytic, sedative, muscle relaxant, and amnesic properties, commonly used to treat severe anxiety disorders, insomnia, alcohol withdrawal syndrome, and chemotherapy-induced nausea and vomiting.", "The use of Iso-Osmotic Dextrose (D5NS) in rats with closed head trauma (CHT) decreased brain edema without changing neurological severity score (NSS) or mortality rate (MR), suggesting its potential benefit in managing CHT-related complications.", "Vancomycin HCl is a glycopeptide antibiotic used to treat various bacterial infections, including complicated skin infections, bloodstream infections, endocarditis, bone and joint infections, and meningitis caused by methicillin-resistant Staphylococcus aureus, and its stability remains within the acceptable range when stored at room temperature or under refrigeration for up to 30 days.", "The prescription 'Potassium Chl 40 mEq / 1000 mL D5W' has been associated with daptomycin-induced severe hyperkalemia in elderly hospitalized patients.", "Nystatin Oral Suspension is a relatively safe and effective antifungal drug used to treat oral or gastrointestinal fungal infections, including Candida spp., and is not absorbed across intact skin or mucous membranes.", "Digoxin is a medication commonly used to treat various heart conditions such as atrial fibrillation, atrial flutter, and heart failure.", "Metronidazole is a nitroimidazole antibiotic and antiprotozoal medication used to treat various infections, including amebiasis, vaginitis, trichomonas infections, giardiasis, anaerobic bacterial infections, and treponemal infections, and it has been proposed as a radiation sensitizer for hypoxic cells, but it may also be a carcinogen.", "The prescription 'Heparin Flush PICC (100 units/ml)' can potentially lead to heparin-induced thrombocytopenia (HIT), a condition characterized by a drop in platelet count and the formation of blood clots, particularly when used for maintenance of a central venous catheter in patients with multiple myeloma.", "Cosyntropin, also known as tetracosactide, is a synthetic peptide that stimulates the production of corticosteroids in the adrenal cortex and is used for diagnostic purposes to determine adrenocortical insufficiency, as well as for therapeutic purposes in various conditions such as autoimmune and inflammatory diseases.", "Lansoprazole Oral Suspension is a medication that effectively controls intragastric pH, is bioequivalent to the intact capsule, and is a suitable option for patients who have difficulty swallowing or are unable to swallow lansoprazole capsules.", "Warfarin is an anticoagulant that inhibits coagulation by preventing carboxylation of vitamin K-dependent clotting factors, and it has been associated with accelerated calcification of aortic valve interstitial cells in patients with aortic stenosis.", "Alteplase is a thrombolytic medication used to treat acute ischemic stroke, acute ST-elevation myocardial infarction, pulmonary embolism associated with low blood pressure, and blocked central venous catheter, and it has been compared to tenecteplase in terms of efficacy and safety for AIS patients.", "Tamsulosin HCl is a medication used to treat symptomatic benign prostatic hyperplasia (BPH) and chronic prostatitis, and it works by blocking alpha-1A and alpha-1B-adrenoceptors in the prostate, prostatic capsule, prostatic urethra, and bladder neck, leading to relaxation of smooth muscles in these areas.", "Levofloxacin is a synthetic fluoroquinolone antibiotic that inhibits bacterial DNA replication and is commonly used to treat various bacterial infections, including sinusitis, pneumonia, urinary tract infections, and gastroenteritis, with established efficacy and safety in both adults and children.", "Dextrose 5% is a commonly used intravenous sugar solution that is administered for nutritional supplementation or to regulate glucose levels in individuals with metabolic disorders.", "The study compared the efficacy and patient acceptability of bambuterol and controlled release salbutamol in treating nocturnal asthma, showing that both treatments were equally effective and well-tolerated, with some patients preferring bambuterol due to its better adverse effect profile and once-daily regimen.", "Heparin is a low molecular weight anticoagulant derived from porcine intestinal mucosa, used for the prevention of postoperative venous thrombosis and also in the treatment of heart attacks and unstable angina.", "Heparin Sodium is a heterogenous preparation of anionic, sulfated glycosaminoglycan polymers that acts as an anticoagulant by binding to antithrombin III and inactivating coagulation enzymes, but it requires continuous infusions and monitoring of activated partial prothrombin time, and has a higher risk of bleeding and osteoporosis in long-term use.", "The prescription 'Albuterol-Ipratropium' is a combination medication used to treat chronic obstructive pulmonary disease (COPD) and asthma, with salbutamol being a short-acting beta2-adrenergic receptor agonist and ipratropium bromide being a nonselective antagonist of muscarinic receptors located on airway smooth muscle.", "Fluticasone propionate 110mcg is a medium-potency synthetic corticosteroid used topically, intranasally, and orally for the treatment of inflammatory and pruritic symptoms of dermatoses, psoriasis, allergic and non-allergic rhinitis, and asthma, and it has been shown to effectively protect against exercise-induced asthma in children with persistent asthma.", "Ipratropium Bromide Neb is a muscarinic antagonist commonly used for bronchial disorders, rhinitis, and as an antiarrhythmic, and it is also a component of the combination medication Duoneb used to treat chronic obstructive pulmonary disease (COPD).", "Acetylcysteine 20% is primarily used as a mucolytic agent, in the management of acetaminophen poisoning, and as a general antioxidant, with reported efficacy in treating various diseases and conditions such as renal impairment, traumatic brain injury, HIV, chronic obstructive pulmonary disease, contrast-induced nephropathy, neuropsychiatric and neurodegenerative disorders, and muscle fatigue."]}, "procedure": {"idxs": ["3521", "3961", "3404", "3893", "966", "9904", "9672", "9604"], "name": ["Opn/oth rep aort vlv-tis", "Extracorporeal circulat", "Insert intercostal cath", "Venous cath NEC", "Entral infus nutrit sub", "Packed cell transfusion", "Cont inv mec ven 96+ hrs", "Insert endotracheal tube"], "def": ["The procedure_id 'Opn/oth rep aort vlv-tis' refers to the surgical repair or replacement of the aortic valve due to a condition known as Opn/oth rep aort vlv-tis, which involves the dysfunction or damage of the aortic valve.", "The procedure_id 'Extracorporeal circulat' refers to a health condition related to the circulation of blood outside the body, which could be valuable for health phenotyping tasks.", "The procedure 'Insert intercostal cath' involves the insertion of a catheter between the ribs, typically used for health-related phenotyping tasks.", "The disease name 'Venous cath NEC' refers to a health condition related to the insertion of a catheter into a vein, which could be valuable information for health phenotyping tasks.", "The procedure_id 'Entral infus nutrit sub' refers to the administration of nutritional substances through the enteral route, which is relevant for health phenotyping tasks related to nutritional support.", "The procedure_id 'Packed cell transfusion' refers to a medical procedure involving the transfusion of packed red blood cells, commonly used in the treatment of various diseases.", "The procedure_id 'Cont inv mec ven 96+ hrs' refers to the disease named Cont inv mec ven 96+ hrs, which is relevant information for health phenotyping task.", "The procedure_id 'Insert endotracheal tube' involves the insertion of a tube into the trachea to assist with breathing, typically used in cases where a patient requires mechanical ventilation."]}, "label": ["1", "0", "0", "1", "0", "0", "1", "0", "0", "0", "0", "0", "0", "0", "1", "0", "0", "0", "0", "0", "0", "0", "0", "1", "1"]}
{"disease": {"idxs": ["038", "427", "787", "501", "788", "294", "280", "389", "785", "285", "574", "562", "584", "591", "276", "995", "996"], "name": ["Septicaemia", "Cardiac dysrhythmias", "Symptoms involving digestive system", "Asbestosis", "Symptoms involving urinary system", "Other organic psychotic conditions (chronic)", "Iron deficiency anemias", "Deafness", "Symptoms involving cardiovascular system", "Other and unspecified anemias", "Cholelithiasis", "Diverticula of intestine", "Acute renal failure", "Hydronephrosis", "Disorders of fluid, electrolyte, and acid-base balance", "Certain adverse effects not elsewhere classified", "Complications peculiar to certain specified procedures"], "def": ["Septicaemia, also known as septicemia or blood poisoning, is a systemic disease caused by the presence of pathogenic microorganisms or their toxins in the blood, leading to potentially life-threatening conditions such as septic shock and sepsis, which can result in low blood pressure, fever, rapid heart rate, lightheadedness, shortness of breath, and confusion.", "Cardiac dysrhythmias, also known as arrhythmias, are irregularities in the heartbeat that can manifest as a fast or slow heart rate, and may cause symptoms such as chest pain, shortness of breath, and dizziness.", "Patients with the disease_id 'Symptoms involving digestive system' may experience a variety of signs and symptoms affecting the digestive system, such as abdominal pain, diarrhea, and bleeding, which can be evaluated through abdominal imaging and endoscopy for diagnosis and management.", "Asbestosis is a form of pneumoconiosis caused by inhalation of asbestos fibers, leading to interstitial fibrosis of the lung, and the risk of lung damage is related to the amount and duration of exposure to asbestos.", "Symptoms involving the urinary system, also known as lower urinary tract symptoms (LUTS), can include clinical disturbances, urinary tract infections, inability to urinate, blood in the urine, and localized bladder inflammation.", "Other organic psychotic conditions (chronic) are psychotic mental disorders resulting from the toxic effect of drugs and chemicals or other harmful substances, and they differ from schizotypal personality disorder and schizophrenia in terms of frequency, duration, and intensity of psychotic episodes.", "Iron deficiency anemias is a condition characterized by low iron stores, decreased hemoglobin concentration, and microcytic hypochromic erythrocytes, and it is the most common cause of anemia worldwide.", "Deafness is a condition that can be caused by various factors, including congenital defects, rubella during pregnancy, and the importance of early diagnosis for interventions and brain development in infants.", "Symptoms involving the cardiovascular system can vary between men and women, with men more likely to experience chest pain and women more likely to experience other symptoms such as shortness of breath, nausea, and extreme fatigue.", "Patients with Other and unspecified anemias may experience congenital hemolytic anemia, anemia associated with bone marrow disease, and anemia prevalent among patients with chronic kidney disease, with suboptimal adherence to treatment guidelines and monitoring of hemoglobin and iron deficiency.", "Cholelithiasis refers to the presence or formation of gallstones in the biliary tract, primarily in the gallbladder or common bile duct, and is often asymptomatic in most individuals.", "Diverticula of the intestine is a condition where pouches or sacs develop in the colon due to weak areas, leading to symptoms like dyschezia and tenesmus, which can be diagnosed and treated through diverticulectomy.", "Acute renal failure, also known as acute kidney injury, is a sudden decrease in kidney function that can be caused by various factors such as decreased blood flow, direct kidney damage, or blockage of urine flow, and it is characterized by symptoms like decreased urinary output, fluid retention, nausea, fatigue, and shortness of breath.", "Hydronephrosis is the abnormal enlargement or swelling of a kidney due to obstruction of the ureter or chronic kidney diseases, leading to the dilation of the kidney calices and pelvis, and it can be diagnosed and monitored using imaging modalities such as functional magnetic resonance urography.", "Patients with disorders of fluid, electrolyte, and acid-base balance may experience disturbances in acid-base equilibrium, electrolyte imbalances, dehydration, and impaired kidney function, which can lead to fluid shifts and metabolic alkalosis.", "Certain adverse effects not elsewhere classified are disorders that result from the intended use of pharmaceutical preparations, including chemically-induced adverse conditions due to toxicity, drug interactions, and metabolic effects. Additionally, the FDA warns about rare serious reactions caused by nonprescription acne products, and the NIOSH provides a hazardous drug list to inform healthcare professionals about protection measures.", "Complications peculiar to certain specified procedures, such as postoperative complications, can vary depending on the surgical procedure and may require special attention, and the Clavien Dindo classification is a validated tool for assessing surgical complications."]}, "prescription": {"idxs": ["135", "431", "210", "206", "21", "20", "456", "16", "27", "15", "6", "302", "451", "278", "112", "255", "55", "267", "610", "118", "155", "163", "285", "286", "125"], "name": ["Norepinephrine", "Piperacillin-Tazobactam", "5% Dextrose", "0.9% Sodium Chloride", "Acetaminophen", "Iso-Osmotic Dextrose", "Heparin Flush (10 units/ml)", "Potassium Chloride", "SW", "Magnesium Sulfate", "Neutra-Phos", "Lansoprazole Oral Disintegrating Tab", "0.9% Sodium Chloride (Mini Bag Plus)", "Ciprofloxacin IV", "Meropenem", "Potassium Phosphate", "Heparin", "Fludrocortisone Acetate", "Donepezil", "Aspirin", "Vancomycin", "Multivitamins", "Ferrous Sulfate", "Omeprazole", "Sodium Chloride 0.9%  Flush"], "def": ["Norepinephrine is a widespread neurotransmitter and hormone that plays a crucial role in the central and sympathetic nervous systems, and its dynamic fluctuations have been linked to various physiological and pathophysiological processes, including Parkinson's disease.", "Piperacillin-Tazobactam is a combination medication containing the antibiotic piperacillin and the β-lactamase inhibitor tazobactam, which is used to treat various bacterial infections and has been evaluated for its safety in comparison to cefepime in a randomized clinical trial.", "The prescription '5% Dextrose' is a glucose solution commonly used for nutritional supplementation or metabolic disorders where glucose levels are improperly regulated, and it is listed as an essential medicine by the World Health Organization.", "0.9% Sodium Chloride, also known as salt, is an essential medicine listed by the World Health Organization and is responsible for the salinity of seawater and extracellular fluid in organisms.", "Acetaminophen, also known as paracetamol, is a widely used non-opioid analgesic and antipyretic medication, commonly used to treat fever and mild to moderate pain, but caution should be exercised to avoid overdose or repeated supratherapeutic ingestion as it can cause acute liver injury.", "The use of Iso-Osmotic Dextrose (D5NS) in rats with closed head trauma (CHT) decreased brain edema without changing neurological severity score (NSS) or mortality rate (MR), suggesting its potential benefit in managing CHT-related complications.", "Heparin Flush (10 units/ml) is a medication used as an anticoagulant in the treatment of heart attacks and unstable angina, and there is no significant difference in catheter longevity when compared to saline flush.", "Potassium chloride is a metal halide salt used in medicine that can be dissolved in water and has a salt-like taste, and it is important for maintaining cellular potassium levels and sodium transport.", "", "Magnesium sulfate is a chemical compound commonly used for tocolysis in the management of preterm labor, and while it may cause alterations in mental status, it does not significantly affect maternal mental status during infusion.", "Neutra-Phos is a phosphate supplementation drug used to treat hypophosphatemia by providing phosphorus to the body, which is essential for bone strength, calcium control, and normal bodily functions, while also reducing renal inflammation and neutrophilic inflammation through the repression of sphingosine 1 phosphate (S1P) signaling and neutrophil extracellular traps (NETosis).", "Orally disintegrating tablets have been shown to be an effective alternative method of drug delivery for non-compliant patients, as they dissolve quickly and prevent tablet cheeking or spitting.", "The prescription '0.9% Sodium Chloride (Mini Bag Plus)' is a commonly used solution containing sodium chloride, which is an essential compound responsible for the salinity of bodily fluids and seawater, and it has been found to be stable for 30 days under various storage conditions.", "Ciprofloxacin IV is a broad-spectrum antimicrobial carboxyfluoroquinoline that inhibits enzymes required for bacterial DNA replication, transcription, repair, and recombination, and is used to treat various bacterial infections.", "Meropenem is an intravenous β-lactam antibiotic used to treat various bacterial infections, and its common side effects include nausea, diarrhea, constipation, headache, rash, and pain at the site of injection.", "Potassium phosphate is a soluble salt of potassium and the dihydrogen phosphate ion, commonly used as a source of phosphorus and potassium, a buffering agent, and a food additive with the E number E340.", "Heparin is a low molecular weight anticoagulant derived from porcine intestinal mucosa, used for the prevention of postoperative venous thrombosis and also in the treatment of heart attacks and unstable angina.", "Fludrocortisone Acetate is a synthetic mineralocorticoid with anti-inflammatory activity commonly used to treat adrenogenital syndrome, postural hypotension, and adrenal insufficiency, but it may cause side effects such as high blood pressure, swelling, heart failure, and low blood potassium.", "Donepezil is a centrally acting reversible acetyl cholinesterase inhibitor primarily used to treat Alzheimer's disease by increasing cortical acetylcholine, and it has also been studied in other cognitive disorders, but its effect may lessen as the disease progresses.", "Aspirin, also known as acetylsalicylic acid, is a nonsteroidal anti-inflammatory drug commonly used for pain relief, fever reduction, inflammation reduction, and as an antithrombotic, but it may cause more harm than benefit for primary prevention of atherosclerotic cardiovascular disease.", "Vancomycin is a glycopeptide antibiotic used to treat various bacterial infections, including complicated skin infections, bloodstream infections, endocarditis, bone and joint infections, and meningitis caused by methicillin-resistant Staphylococcus aureus, and therapeutic drug monitoring is recommended to optimize therapy and prevent nephrotoxicity.", "Multivitamins are dietary supplements containing various vitamins, minerals, and other nutrients, commonly used to improve micronutrient adequacy, but their efficacy in improving health outcomes, particularly in older populations, remains limited and requires further investigation.", "Ferrous sulfate, also known as Green vitriol, is a synthetic iron supplement used to treat or prevent low blood levels of iron, such as anemia or during pregnancy.", "Omeprazole is a medication commonly used to treat gastroesophageal reflux disease, peptic ulcer disease, and Zollinger-Ellison syndrome, and it can be administered orally or rectally in infants with pathological GERD.", "Sodium chloride 0.9% flush is a commonly used and safe solution for flushing and locking peripheral intravenous access devices, as it does not increase the risks of occlusion or other adverse events, and is as effective as heparin saline solution."]}, "procedure": {"idxs": ["3893"], "name": ["Venous cath NEC"], "def": ["The disease name 'Venous cath NEC' refers to a health condition related to the insertion of a catheter into a vein, which could be valuable information for health phenotyping tasks."]}, "label": ["0", "0", "0", "1", "0", "0", "1", "0", "1", "0", "0", "0", "0", "0", "1", "0", "0", "0", "0", "0", "0", "0", "0", "1", "0"]}
{"disease": {"idxs": ["444", "584", "442", "515", "403", "585", "716"], "name": ["Arterial embolism and thrombosis", "Acute renal failure", "Other aneurysm", "Postinflammatory pulmonary fibrosis", "Hypertensive renal disease", "Chronic renal failure", "Other and unspecified arthropathies"], "def": ["Arterial embolism and thrombosis is a rare but critical complication that can occur in patients with new onset nephrotic syndrome, leading to severe ischemia and potentially requiring amputation, and early recognition is crucial for intervention and prevention of serious sequelae.", "Acute renal failure, also known as acute kidney injury, is a sudden decrease in kidney function that can be caused by various factors such as decreased blood flow, direct kidney damage, or blockage of urine flow, and it is characterized by symptoms like decreased urinary output, fluid retention, nausea, fatigue, and shortness of breath.", "Other aneurysm refers to an abnormal outpouching in the wall of intracranial blood vessels, commonly found at branch points in the Circle of Willis, which can result in subarachnoid hemorrhage or intracranial hemorrhages and may require closer observation in patients with multiple aneurysms.", "Postinflammatory pulmonary fibrosis is a common interstitial lung disease characterized by breathlessness, cough, and progressive dyspnea, with potential associations to gastroesophageal reflux disease and COVID-19-induced fibrosis.", "Hypertensive renal disease refers to kidney damage caused by chronic high blood pressure, often associated with conditions such as renal parenchymal diseases, renal vasculature issues, or tumors secreting renin, and it can lead to irreversible kidney damage and complications such as posterior reversible encephalopathy syndrome (PRES).", "Chronic renal failure, also known as chronic kidney disease, is a progressive condition characterized by severe kidney damage, reduced kidney function, and potential complications such as high blood pressure, bone disease, anemia, and dysfunction of the autonomic nervous system, which can lead to sudden cardiac death.", "Other and unspecified arthropathies encompass a heterogeneous group of arthritic diseases, primarily affecting the axial joints in the spine, such as the sacroiliac joint, but can also involve asymmetric peripheral joints, and may be associated with the HLA-B27 antigen and triggering infections."]}, "prescription": {"idxs": ["126", "119", "191", "124", "210", "3", "28", "15", "24", "274", "55", "510", "68", "21", "148", "207", "146", "9", "125", "118", "198", "244", "4", "82", "56", "8", "305", "996", "171", "7", "206", "190"], "name": ["Insulin Human Regular", "Sodium Bicarbonate", "Iso-Osmotic Sodium Chloride", "LR", "5% Dextrose", "D5W", "Calcium Gluconate", "Magnesium Sulfate", "Morphine Sulfate", "Influenza Virus Vaccine", "Heparin", "Fluticasone Propionate NASAL", "Pantoprazole", "Acetaminophen", "HYDROmorphone (Dilaudid)", "HydrALAzine", "Potassium Chl 20 mEq / 1000 mL NS", "Insulin", "Sodium Chloride 0.9%  Flush", "Aspirin", "Simvastatin", "Metoprolol Tartrate", "Furosemide", "Bisacodyl", "Senna", "Docusate Sodium", "Diltiazem Extended-Release", "Guaifenesin-CODEINE Phosphate", "Acetylcysteine 20%", "Nitroglycerin", "0.9% Sodium Chloride", "Famotidine"], "def": ["Insulin Human Regular, also known as Regular Insulin, is a short-acting form of insulin used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes, and it promotes glucose metabolism, inhibits hepatic glucose production, enhances protein synthesis, and inhibits lipolysis and proteolysis among other functions.", "Sodium bicarbonate is a white, crystalline powder commonly used as a pH buffering agent, electrolyte replenisher, systemic alkalizer, and in topical cleansing solutions, and its use for the treatment of severe metabolic acidaemia remains controversial.", "Iso-Osmotic Sodium Chloride, also known as salt, is an ionic compound that is responsible for the salinity of seawater and extracellular fluid, and its effects on growth and metabolism have been studied in ornamental shrubs.", "LR is a disease that involves long latency reflexes (LLRs) which are late responses in nerve conduction studies, providing a measure of proximal nerve and central conduction, and can be used for evaluating central nervous system or proximal peripheral nerve disorders.", "The prescription '5% Dextrose' is a glucose solution commonly used for nutritional supplementation or metabolic disorders where glucose levels are improperly regulated, and it is listed as an essential medicine by the World Health Organization.", "D5W, a form of dextrose 5% in water, is commonly used intravenously to replace lost fluids, provide carbohydrates, and treat low blood sugar or water loss without electrolyte loss in various medical conditions.", "Calcium gluconate is a calcium salt used as a mineral supplement and medication, primarily administered through injection to treat low blood calcium, high blood potassium, and magnesium toxicity.", "Magnesium sulfate is a chemical compound commonly used for tocolysis in the management of preterm labor, and while it may cause alterations in mental status, it does not significantly affect maternal mental status during infusion.", "Morphine sulfate is a potent analgesic derived from opium that is commonly used for chronic pain management, but its use is limited due to the risk of tolerance, withdrawal symptoms, and abuse, and it is also the precursor to other opioids.", "The Influenza Virus Vaccine, also known as flu shots, protects against infection by influenza viruses and new versions are developed twice a year to keep up with the rapidly changing virus, offering modest to high protection against influenza.", "Heparin is a low molecular weight anticoagulant derived from porcine intestinal mucosa, used for the prevention of postoperative venous thrombosis and also in the treatment of heart attacks and unstable angina.", "Fluticasone propionate nasal spray is a medium-potency corticosteroid used topically to relieve symptoms of dermatoses, psoriasis, allergic and non-allergic rhinitis, and orally for asthma treatment, with a combination product called Dymista indicated for seasonal allergic rhinitis relief in patients over 12 years old.", "Pantoprazole is a first-generation proton pump inhibitor that is commonly used for the treatment of gastroesophageal reflux disease (GERD) and other disorders requiring a decrease in gastric acid secretion, and it is available in various forms including oral capsules, oral suspension, and intravenous injection.", "Acetaminophen, also known as paracetamol, is a widely used non-opioid analgesic and antipyretic medication, commonly used to treat fever and mild to moderate pain, but caution should be exercised to avoid overdose or repeated supratherapeutic ingestion as it can cause acute liver injury.", "Hydromorphone (Dilaudid) is an opioid analgesic used to treat moderate to severe pain, including pain in obstetrics, and as an adjunct to anesthesia, but it has been requested to be removed from the market due to opioid misuse and abuse risks associated with its injectable reformulation.", "Hydralazine is a medication used to treat high blood pressure and heart failure, and it is a time-dependent inhibitor of the cytosolic drug metabolizing enzyme aldehyde oxidase (AO), with glutathione (GSH) suppressing its inhibition and playing a role in trapping a hydralazine reactive intermediate prior to enzyme inactivation.", "Potassium chloride administered via intracardiac injection, intracoelomic injection, or bilateral topical delivery over the gill filaments was found to be effective for euthanasia of adult goldfish, with varying time frames for cessation of Doppler sound and the occurrence of transient movements.", "Insulin is a short-acting peptide hormone produced by beta cells of the pancreas that promotes glucose metabolism, regulates the absorption of glucose into cells, inhibits hepatic glucose production, enhances protein synthesis, and is used for the treatment of hyperglycemia caused by Type 1 and Type 2 Diabetes.", "Sodium chloride 0.9% flush is a commonly used and safe solution for flushing and locking peripheral intravenous access devices, as it does not increase the risks of occlusion or other adverse events, and is as effective as heparin saline solution.", "Aspirin, also known as acetylsalicylic acid, is a nonsteroidal anti-inflammatory drug commonly used for pain relief, fever reduction, inflammation reduction, and as an antithrombotic, but it may cause more harm than benefit for primary prevention of atherosclerotic cardiovascular disease.", "Simvastatin is a statin medication used to lower lipid levels and reduce the risk of heart problems, and when combined with ezetimibe, it provides greater LDL cholesterol lowering effects and improves lipid and inflammatory profiles in hypercholesterolemic patients with metabolic syndrome.", "Metoprolol Tartrate is a widely prescribed beta-blocker medication used to treat high blood pressure, chest pain, fast heart rate, and prevent further heart problems, with different formulations available for immediate release, extended release, and controlled release.", "Furosemide is a loop diuretic commonly used to treat edema and chronic renal insufficiency, and it may also be used for the treatment of high blood pressure.", "Bisacodyl is a stimulant laxative used for the treatment of constipation and stimulation of bowel movement, and it works directly on the colon to produce a bowel movement.", "Senna is a medication used to treat constipation and empty the large intestine before surgery, and it has been found to inhibit the ribonuclease H activity of HIV reverse transcriptase.", "Docusate Sodium is a commonly prescribed stool softener and laxative for the treatment of constipation, although its effectiveness remains unclear and it may not alleviate associated symptoms such as abdominal cramps.", "Diltiazem Extended-Release is a calcium channel blocker medication used to treat high blood pressure, angina, and certain heart arrhythmias, but incomplete ingestion of the medication can lead to an inflammatory mass causing possible acute airway compromise.", "Guaifenesin-CODEINE Phosphate is a medication commonly used as a cough suppressant, but its effectiveness in reducing cough symptoms is unclear or minimal, and it is not recommended for children six years or younger due to lack of evidence and potential harm.", "Acetylcysteine 20% is primarily used as a mucolytic agent, in the management of acetaminophen poisoning, and as a general antioxidant, with reported efficacy in treating various diseases and conditions such as renal impairment, traumatic brain injury, HIV, chronic obstructive pulmonary disease, contrast-induced nephropathy, neuropsychiatric and neurodegenerative disorders, and muscle fatigue.", "Nitroglycerin is a volatile vasodilator that relieves angina pectoris by stimulating guanylate cyclase, lowering cytosolic calcium, and is commonly used in the manufacture of explosives.", "0.9% Sodium Chloride, also known as salt, is an essential medicine listed by the World Health Organization and is responsible for the salinity of seawater and extracellular fluid in organisms.", "Famotidine is a histamine H2 receptor antagonist medication that inhibits gastric secretion and is used to treat peptic ulcer disease, gastroesophageal reflux disease, and Zollinger-Ellison syndrome, with potential side effects including headache, intestinal upset, and dizziness."]}, "procedure": {"idxs": ["3808", "8314", "3929", "8848"], "name": ["Lower limb artery incis", "Fasciotomy", "Vasc shunt & bypass NEC", "Contrast arteriogram-leg"], "def": ["The procedure_id 'Lower limb artery incis' refers to a health condition related to the incision of the arteries in the lower limb.", "Fasciotomy is a surgical procedure used to treat conditions that cause increased pressure within muscles, and it involves making incisions to relieve the pressure and prevent tissue damage.", "The procedure_id 'Vasc shunt & bypass NEC' refers to a health procedure involving the creation of a vascular shunt or bypass, which is relevant for health phenotyping tasks.", "The procedure_id 'Contrast arteriogram-leg' refers to a health procedure that involves the use of contrast dye to examine the arteries in the leg."]}, "label": ["1", "0", "0", "0", "1", "1", "0", "0", "0", "0", "0", "1", "0", "0", "0", "0", "1", "1", "1", "0", "0", "1", "0", "1", "0"]}
